Repository: szczyglis-dev/py-gpt
Catalog: docs/source/locale/*/LC_MESSAGES/addons.po
Languages: pl

source: Additional information
pl: Dodatki

source: Compiling from sources
pl: Kompilacja ze źródeł

source: PyInstaller is used for compilation.
pl: Do kompilacji używany jest PyInstaller.

source: In the project directory there are configuration files for Windows and Linux:
pl: W katalogu z projektem znajdują się pliki z konfiguracją dla Windowsa i Linuxa:

source: **Build for Windows (CPU version):**
pl: **Kompilacja dla Windows (wersja CPU):**

source: **Build for Windows (GPU version):**
pl: **Kompilacja dla Windows (wersja GPU):**

source: The Windows GPU version requires the ``zlibwapi.dll`` library, it is located in the ``lib`` directory. MVC libraries are also included with the windows build. NVidia CUDA libraries are required on the system (recommended installation with conda).
pl: Wersja GPU dla Windows wymaga biblioteki ``zlibwapi.dll``, znajduje się ona w katalogu ``lib``. Do builda windowsowego dołączane są też biblioteki MVC. W systemie wymagane są biblioteki CUDA (zalecana instalacja za pomocą conda).

source: **Build for Linux:**
pl: **Kompilacja dla Linux:**

source: Configuration - list of parameters
pl: Konfiguracja – lista parametrów

source: **config.ini** file:
pl: Plik **config.ini**:

source: **Syntax:** key - description, type [possible values] (default value)
pl: **Składnia:** klucz - opis, typ [możliwe wartości] (wartość domyślna)

source: **app.lang** - application language, string [pl|en] (en)
pl: **app.lang** - język aplikacji, string [pl|en] (pl)

source: **app.model** - AI model, string (none)
pl: **app.model** - model AI, string (none)

source: **app.source** - default mode, string [cam|video|stream|remote] (cam)
pl: **app.source** - domyślny tryb pracy, string [cam|video|stream|remote] (cam)

source: **app.video_url** - default video file, string
pl: **app.video_url** - domyślny plik video, string

source: **app.stream_url** - default URL with stream, string
pl: **app.stream_url** - domyślny adres URL ze streamem, string

source: **app.remote_host** - default remote host, string
pl: **app.remote_ip** - domyślny zdalny host, string

source: **app.remote_ip** - default remote IP, string
pl: **app.remote_ip** - domyślne zdalne IP, string

source: **app.disabled** - on/off pause in the application, bool [1|0] (0)
pl: **app.disabled** - wł/wył. pauzę w aplikacji, bool [1|0] (0)

source: **app.ai** - on/off AI in application, bool [1|0] (1)
pl: **app.ai** - wł/wył. AI w aplikacji, bool [1|0] (1)

source: **app.debug** - on/off debugger in the application, bool [1|0] (1)
pl: **app.debug** - wł/wył debugger w aplikacji, bool [1|0] (1)

source: **security.web.token** - security token for web application, string
pl: **security.web.token** - token zabezpieczajacy dla webaplikacji, string

source: **security.aes.video** - on/off video image encryption using AES during connection, bool [1|0] (1)
pl: **security.aes.video** - wł/wył. szyfrowanie obrazu video za pomocą AES podczas połączenia, bool [1|0] (1)

source: **security.aes.data** - on/off data encryption using AES while connections, bool [1|0] (1)
pl: **security.aes.data** - wł/wył. szyfrowanie danych za pomocą AES podczas połączenia, bool [1|0] (1)

source: **security.aes.key** - 16 character-length secret encryption key, must be the same on the client and on the server, string
pl: **security.aes.key** - 16 znakowy tajny klucz szyfrujący, musi być taki sam na kliencie i na serwerze, string

source: **camera.idx** - default camera index, integer (0)
pl: **camera.idx** - indeks domyślnej kamery, integer (0)

source: **camera.fov.x** - FOV in X axis /horizontal/ in degrees, integer (100)
pl: **camera.fov.x** - FOV w osi X /poziomy/ w stopniach, integer (100)

source: **camera.fov.y** - FOV in Y axis /vertical in degrees/, integer (68)
pl: **camera.fov.y** - FOV w osi Y /pionowy w stopniach/, integer (68)

source: **camera.width** - width of the captured video in px, integer (1280)
pl: **camera.width** - szerokość przechwytywanego obrazu w px, integer (1280)

source: **camera.height** - height of the captured video in px, integer (720)
pl: **camera.height** - wysokość przechwytywanego obrazu w px, integer (720)

source: **camera.fps** - number of frames of the captured video per second, integer (30)
pl: **camera.fps** - ilość klatek przechwytywanego obrazu na sekundę, integer (30)

source: **servo.enabled** - on/off. servo, bool [1|0] (1)
pl: **servo.enabled** - wł/wył.. serwomechanizm, bool [1|0] (1)

source: **servo.enabled.x** - on/off x-axis, bool [1|0] (1)
pl: **servo.enabled.x** - wł/wył. oś X, bool [1|0] (1)

source: **servo.enabled.y** - on/off Y axis, bool [1|0] (1)
pl: **servo.enabled.y** - wł/wył. oś Y, bool [1|0] (1)

source: **servo.local** - default local port address, string
pl: **servo.local** - domyślny adres portu lokalnego, string

source: **servo.remote** - default IP address of the remote client, string
pl: **servo.remote** - domyślny adres IP zdalnego klienta, string

source: **servo.map_fov** - on/off mapping the FOV of the camera to the movement of the mechanism, bool [1|0] (1)
pl: **servo.map_fov** - wł/wył. mapowanie FOV kamery na ruch mechanizmu, bool [1|0] (1)

source: **servo.use_limit** = on/off mapping by limit instead of max angle, bool [1|0] (0)
pl: **servo.use_limit** = wł/wył. mapowanie wg limitu, zamiast max angle, bool [1|0] (0)

source: **servo.angle.start.x** - initial deflection of the servo in the X axis, integer (90)
pl: **servo.angle.start.x** - inicjalne wychylenie serwomechanizmu w osi X, integer (90)

source: **servo.angle.start.y** - initial deflection of the servo in the Y axis, integer (90)
pl: **servo.angle.start.y** - inicjalne wychylenie serwomechanizmu w osi Y, integer (90)

source: **servo.angle.min.x** - min. deflection of the servo in the X axis, integer (0) # servo parameter
pl: **servo.angle.min.x** - min. wychylenie serwomechanizmu w osi X, integer (0) # parametr serwa

source: **servo.angle.min.y** - min. deflection of the servo in the Y axis, integer (0) # servo parameter
pl: **servo.angle.min.y** - min. wychylenie serwomechanizmu w osi Y, integer (0) # parametr serwa

source: **servo.angle.max.x** - max. deflection of the servo in the X axis, integer (180) # servo parameter
pl: **servo.angle.max.x** - max. wychylenie serwomechanizmu w osi X, integer (180) # parametr serwa

source: **servo.angle.max.y** - max. deflection of the servo in the Y axis, integer (180) # servo parameter
pl: **servo.angle.max.y** - max. wychylenie serwomechanizmu w osi Y, integer (180) # parametr serwa

source: **servo.limit.min.x** - min. allowed movement of the servo in the X axis, integer(0) # physical, real possibility
pl: **servo.limit.min.x** - min. dozwolony ruch serwomechanizmu w osi X, integer (0) # fizyczna, realna możliwość

source: **servo.limit.min.y** - min. allowed movement of the servo in the Y axis, integer(0) # physical, real possibility
pl: **servo.limit.min.y** - min. dozwolony ruch serwomechanizmu w osi Y, integer (0) # fizyczna, realna możliwość

source: **servo.limit.max.x** - max. allowed movement of the servo in the X axis, integer (180) # physical, real possibility
pl: **servo.limit.max.x** - max. dozwolony ruch serwomechanizmu w osi X, integer (180) # fizyczna, realna możliwość

source: **servo.limit.max.y** - max. allowed movement of the servo in the Y axis, integer (180) # physical, real possibility
pl: **servo.limit.max.y** - max. dozwolony ruch serwomechanizmu w osi Y, integer (180) # fizyczna, realna możliwość

source: **servo.angle.step.x** = min. difference in angles for sending the w command X axis, integer (1)
pl: **servo.angle.step.x** = min. różnica w kątach dla wysłania komendy w osi X, integer (1)

source: **servo.angle.step.y** = min. difference in angles for sending the w command Y axis, integer (1)
pl: **servo.angle.step.y** = min. różnica w kątach dla wysłania komendy w osi Y, integer (1)

source: **servo.angle.multiplier.x** - multiplier of steps in the X axis, integer (1)
pl: **servo.angle.multiplier.x** - mnożnik kroków w osi X, integer (1)

source: **servo.angle.multiplier.y** - multiplier of steps in the Y axis, integer (1)
pl: **servo.angle.multiplier.y** - mnożnik kroków w osi Y, integer (1)

source: **server.port.data** - port for sending data on the client, integer (6666)
pl: **server.port.data** - port dla wysyłki danych na kliencie, integer (6666)

source: **server.port.conn** - port for initiating connection on the client, integer (6667)
pl: **server.port.conn** - port dla inicjowania połaczenia na kliencie, integer (6667)

source: **server.port.status** - port for receiving status from the client, integer (6668)
pl: **server.port.status** - port dla odbioru statusu od klienta, integer (6668)

source: **serial.data.baud_rate** – transfer speed for serial connections, int (9600)
pl: **serial.data.baud_rate** – prędkość transferu dla połaczeń szeregowych, int (9600)

source: **serial.data.format** - format of data sent to the device by serial port, string [RAW|JSON] (RAW)
pl: **serial.data.format** - format danych wysyłanych do urządzenia przez port szeregowy, string [RAW|JSON] (RAW)

source: **clients.conn_wait** - max. waiting time in seconds for the next connection, integer (5)
pl: **clients.conn_wait** - max. czas oczekiwania w sekundach na nast. połączenie, integer (5)

source: **clients.hang_time** - max. time to consider a call on hold, in seconds, integer (5)
pl: **clients.hang_time** - max. czas do uznania połączenia za zawieszone, w sekundach, integer (5)

source: **clients.inactive_time** - time until the connection is considered inactive, in seconds, integer (5)
pl: **clients.inactive_time** - czas do uznania połączenia za nieaktywne, w sekundach, integer (5)

source: **clients.stream.jpeg** - enable/disable JPEG decompression, required if client compression is enabled, bool [1|0] (0)
pl: **clients.stream.jpeg** - wł./wył dekompresję JPEG, wymagane jeśli włączona jest kompresja u klienta, bool [1|0] (0)

source: **target.mode** - default auto mode, string [OFF|IDLE|FOLLOW|PATROL] (IDLE)
pl: **target.mode** - domyślny tryb auto, string [OFF|IDLE|FOLLOW|PATROL] (IDLE)

source: **target.point** - default aiming point [AUTO|HEAD|NECK|BODY|LEGS] (AUTO)
pl: **target.point** - domyślny punkt celowania [AUTO|HEAD|NECK|BODY|LEGS] (AUTO)

source: **target.locked** - on/off locating on object, bool [1|0] (0)
pl: **target.locked** - wł/wył. lokowanie na obiekcie, bool [1|0] (0)

source: **target.single** - on/off placing on a single target, , bool [1|0] (0)
pl: **target.single** - wł/wył. lokowanie na pojedyńczym celu, bool [1|0] (0)

source: **target.delay** - delay in aiming auto, float (0.40)
pl: **target.delay** - opóźnienie w celowaniu auto, float (0.40)

source: **target.speed** - aiming speed multiplier, float (0.1)
pl: **target.speed** - mnożnik prędkości przy celowaniu, float (0.1)

source: **target.smooth** - multiplier for smoothing movement when aiming, float (1.6)
pl: **target.smooth** - mnożnik wygładzania ruchu przy celowaniu, float (1.6)

source: **target.threshold.x** - value slowing down in the X axis (0.15)
pl: **target.threshold.x** - wartość spowalniająca w osi X (0.15)

source: **target.threshold.y** - value slowing down in the Y axis (0.15)
pl: **target.threshold.y** - wartość spowalniająca w osi Y (0.15)

source: **target.brake** - on/off servo stopping in the absence of a target, bool [1|0] (1)
pl: **target.brake** - wł/wył. wygaszanie ruchu w przypadku braku celu, bool [1|0] (1)

source: **target.smooth.follow** - on/off tracking motion smoothing, bool [1|0] (0)
pl: **target.smooth.follow** - wł/wył. wygładzanie ruchu śledzenia, bool [1|0] (0)

source: **target.smooth.camera** - on/off camera smoothing, bool [1|0] (1)
pl: **target.smooth.camera** - wł/wył wygładzania ruchu kamery, bool [1|0] (1)

source: **target.mean.target** - on/off smoothing target coordinates, bool [1|0] (1)
pl: **target.mean.target** - wł/wył. wygładzanie koordynat celu, bool [1|0] (1)

source: **target.mean.now** - on/off smoothing tracking coordinates, bool [1|0] (1)
pl: **target.mean.now** - wł/wył. wygładzanie koordynat śledzenia, bool [1|0] (1)

source: **target.mean.cam** - on/off smoothing camera coordinates, bool [1|0] (0)
pl: **target.mean.cam** - wł/wył. wygładzanie koordynat kamery, bool [1|0] (0)

source: **target.mean.target.step** - min. movement required during smoothing target coordinate, float (0.005)
pl: **target.mean.target.step** - min. wymagany ruch podczas wygładzania koordynat celu, float (0.005)

source: **target.mean.now.step** - min. movement required during smoothing tracking coordinate, float (0.01)
pl: **target.mean.now.step** - min. wymagany ruch podczas wygładzania koordynat śledzenia, float (0.01)

source: **target.mean.cam.step** - min. movement required during smoothing camera coordinates, float (0.01)
pl: **target.mean.cam.step** - min. wymagany ruch podczas wygładzania koordynat kamery, float (0.01)

source: **target.mean.target.depth** - number of records of previous moves during smoothing target coordinates, integer (2)
pl: **target.mean.target.depth** - ilość zapisów poprzednich ruchów podczas wygładzania koordynat celu, integer (2)

source: **target.mean.now.depth** - number of records of previous moves during tracking coordinate smoothing, integer (2)
pl: **target.mean.now.depth** - ilość zapisów poprzednich ruchów podczas wygładzania koordynat śledzenia, integer (2)

source: **target.mean.cam.depth** - number of records of previous moves during smoothing camera coordinates, integer (2)
pl: **target.mean.cam.depth** - ilość zapisów poprzednich ruchów podczas wygładzania koordynat kamery, integer (2)

source: **target.action.name** - default action, string [A1|A2|A3|B4|B5|B6] (A1)
pl: **target.action.name** - domyślna akcja, string [A1|A2|A3|B4|B5|B6] (A1)

source: **target.action.mode** - default action mode, string [SINGLE|CONTINUOUS|SERIES|TOGGLE] (CONTINUOUS)
pl: **target.action.mode** - domyślny tryb dla akcji, string [SINGLE|CONTINUOUS|SERIES|TOGGLE] (CONTINUOUS)

source: **target.action.enable** - on/off auto actions, bool [1|0] (0)
pl: **target.action.enable** - wł/wył. auto akcje, bool [1|0] (0)

source: **target.action.length** - duration of the action, integer (10)
pl: **target.action.length** - długość czasu trwania akcji, integer (10)

source: **target.action.switch** - length of interval between target change, integer (30)
pl: **target.action.switch** - długość odstępu między zmianą celu, integer (30)

source: **target.time.before_target** - time required before targeting, float (0.3)
pl: **target.time.before_target** - czas wymagany przed namierzeniem, float (0.3)

source: **target.time.as_target** - time to be considered targeted, integer (3)
pl: **target.time.as_target** - czas do uznania za namierzony, integer (3)

source: **target.time.as_lost** - time to be considered lost, integer (30)
pl: **target.time.as_lost** - czas do uznania za stracony, integer (30)

source: **target.limit.on_target** - max. counter on target, integer (999)
pl: **target.limit.on_target** - max. licznik na celu, integer (999)

source: **patrol.timeout** - waiting time for starting the patrol /ms/, integer (2000)
pl: **patrol.timeout** - czas oczekiwania na uruchomienie patrolu /ms/, integer (2000)

source: **patrol.step** - patrol movement step, float (0.005)
pl: **patrol.step** - krok ruchu podczas patrolu, float (0.005)

source: **patrol.interval** - time interval for patrol traffic, integer (600)
pl: **patrol.interval** - interwał czasowy dla ruchu patrolu, integer (600)

source: **patrol.direction** - default patrol direction, string [LEFT|RIGHT] (RIGHT)
pl: **patrol.direction** - domyślny kierunek ruchu w patrolu, string [LEFT|RIGHT] (RIGHT)

source: **manual.speed** - default speed of manual control, integer (20)
pl: **manual.speed** - domyślna prędkość sterowania manualnego, integer (20)

source: **manual.action.mode** - default action mode for manual control, string [OFF|SINGLE|CONTINUOUS|SERIES|TOGGLE] (OFF)
pl: **manual.action.mode** - domyślny tryb akcji przy sterowaniu manualnym, string [OFF|SINGLE|CONTINUOUS|SERIES|TOGGLE] (OFF)

source: **render.full_screen** - on/off fullscreen, bool [1|0] (0)
pl: **render.full_screen** - wł/wył. pełny ekran, bool [1|0] (0)

source: **render.fit** - on/off fit to screen, bool [1|0] (1)
pl: **render.fit** - wł/wył. dopasowanie do ekranu, bool [1|0] (1)

source: **render.tracking** - on/off display trace, bool [1|0] (1)
pl: **render.tracking** - wł/wył. wyśw. śledzenia, bool [1|0] (1)

source: **render.targeting** - on/off display aiming, bool [1|0] (1)
pl: **render.targeting** - wł/wył. wyśw. celowania, bool [1|0] (1)

source: **render.bounds** - on/off display boxes, bool [1|0] (1)
pl: **render.bounds** - wł/wył. wyśw. boxów, bool [1|0] (1)

source: **render.labels** - on/off display labels, bool [1|0] (1)
pl: **render.labels** - wł/wył. wyśw. etykiet, bool [1|0] (1)

source: **render.text** - on/off display text, bool [1|0] (1)
pl: **render.text** - wł/wył. wyśw. tekstu, bool [1|0] (1)

source: **render.zoom** - zoom value, integer (0)
pl: **render.zoom** - wartość zoom-u, integer (0)

source: **render.minimized** - on/off minimized on start, bool [1|0] (0)
pl: **render.minimized** - wł/wył. zminimalizowany na starcie, bool [1|0] (0)

source: **render.maximized** - on/off maximized on start, bool [1|0] (0)
pl: **render.maximized** - wł/wył. zmaxymalizowany na starcie, bool [1|0] (0)

source: **render.console** - on/off display console, bool [1|0] (1)
pl: **render.console** - wł/wył. wyśw. konsoli, bool [1|0] (1)

source: **render.simulator** - on/off servo motion simulator, bool [1|0] (0)
pl: **render.simulator** - wł/wył. symulator ruchu serwa, bool [1|0] (0)

source: **render.montage.cols** - number of columns in preview mode, integer (2)
pl: **render.montage.cols** - ilość kolumn w trybie podglądu, integer (2)

source: **render.montage.rows** - number of rows in preview mode, integer (2)
pl: **render.montage.rows** - ilość wierszy w trybie podglądu, integer (2)

source: **render.montage.width** - box width in px in preview mode, integer (400)
pl: **render.montage.width** - szerokość boxa w px w trybie podglądu, integer (400)

source: **render.overlay.status.font.size** - font size for text for overlay, integer (1)
pl: **render.overlay.status.font.size** - rozmiar czcionki dla tekstu dla overlaya, integer (1)

source: **render.overlay.status.font.thickness** - font thickness for text for overlay, integer (1)
pl: **render.overlay.status.font.thickness** - grubość czcionki dla tekstu dla overlaya, integer (1)

source: **video.loop** - on/off video loop, bool [1|0] (1)
pl: **video.loop** - wł/wył. zapętlenie obrazu video, bool [1|0] (1)

source: **stream.loop** - on/off image loop for stream, bool [1|0] (1)
pl: **stream.loop** - wł/wył. zapętlenie obrazu dla streamu, bool [1|0] (1)

source: **area.target** - on/off area for tracking, bool [1|0] (0)
pl: **area.target** - wł/wył. obszar dla śledzenia, bool [1|0] (0)

source: **area.target.world** - on/off mapping to the world of the area for trace, bool [1|0] (0)
pl: **area.target.world** - wł/wył. mapowanie do świata obszaru dla śledzenia, bool [1|0] (0)

source: **area.target.x** - X coordinate, normalized in the range between 0-1, float (0)
pl: **area.target.x** - współrzędna X, znormalizowana w zakresie 0-1, float (0)

source: **area.target.y** - Y coordinate, normalized in the range between 0-1, float (0)
pl: **area.target.y** - współrzędna Y, znormalizowana w zakresie 0-1, float (0)

source: **area.target.w** - width, normalized in the range between 0-1, float (0)
pl: **area.target.w** - szerokość, znormalizowana w zakresie 0-1, float (0)

source: **area.target.h** - height, normalized in the range between 0-1, float (0)
pl: **area.target.h** - wysokość, znormalizowana w zakresie 0-1, float (0)

source: **area.patrol** - on/off patrol area, bool [1|0] (0/
pl: **area.patrol** - wł/wył. obszar dla patrolu, bool [1|0] (0)

source: **area.patrol.world** - on/off mapping to the world of the patrol area, bool [1|0] (0)
pl: **area.patrol.world** - wł/wył. mapowanie do świata obszaru dla patrolu, bool [1|0] (0)

source: **area.patrol.x** - X coordinate, normalized in the range between 0-1, float (0)
pl: **area.patrol.x** - współrzędna X, znormalizowana w zakresie 0-1, float (0)

source: **area.patrol.y** - Y coordinate, normalized in the range between 0-1, float (0)
pl: **area.patrol.y** - współrzędna Y, znormalizowana w zakresie 0-1, float (0)

source: **area.patrol.w** - width, normalized in the range between 0-1, float (0)
pl: **area.patrol.w** - szerokość, znormalizowana w zakresie 0-1, float (0)

source: **area.patrol.h** - height, normalized in the range between 0-1, float (0)
pl: **area.patrol.h** - wysokość, znormalizowana w zakresie 0-1, float (0)

source: **area.action** - on/off area for action, bool [1|0] (0)
pl: **area.action** - wł/wył. obszar dla akcji, bool [1|0] (0)

source: **area.action.world** - on/off mapping to the world of the action area, bool [1|0] (0)
pl: **area.action.world** - wł/wył. mapowanie do świata obszaru dla akcji, bool [1|0] (0)

source: **area.action.x** - X coordinate, normalized in the range between 0-1, float (0)
pl: **area.action.x** - współrzędna X, znormalizowana w zakresie 0-1, float (0)

source: **area.action.y** - Y coordinate, normalized in the range between 0-1, float (0)
pl: **area.action.y** - współrzędna Y, znormalizowana w zakresie 0-1, float (0)

source: **area.action.w** - width, normalized in the range between 0-1, float (0)
pl: **area.action.w** - szerokość, znormalizowana w zakresie 0-1, float (0)

source: **area.action.h** - height, normalized in the range between 0-1, float (0)
pl: **area.action.h** - wysokość, znormalizowana w zakresie 0-1, float (0)

source: **filter.detect.classes** - class names for the detection filter, string [class1,class2,class3,...]
pl: **filter.detect.classes** - nazwy klas dla filtra wykrywania, string [klasa1,klasa2,klasa3,...]

source: **filter.detect.min_score** - min. detection score, float (0.2)
pl: **filter.detect.min_score** - min. punktacja dla wykrywania, float (0.2)

source: **filter.target.classes** - class names for the targeting filter, string [class1,class2,class3,...]
pl: **filter.target.classes** - nazwy klas dla filtra namierzania, string [klasa1,klasa2,klasa3,...]

source: **filter.target.min_score** - min. score for pinpointing, float (0.2)
pl: **filter.target.min_score** - min. punktacja dla namierzania, float (0.2)

source: **filter.action.classes** - class names for the action filter, string [class1,class2,class3,...]
pl: **filter.action.classes** - nazwy klas dla filtra akcji, string [klasa1,klasa2,klasa3,...]

source: **filter.action.min_score** - min. action score, float (0.2)
pl: **filter.action.min_score** - min. punktacja dla akcji, float (0.2)

source: **video_filter.input** - default video filters for input, string [filter1,filter2,filter3,...]
pl: **video_filter.input** - domyślne filtry video dla wejścia, string [filtr1,filtr2,filtr3,...]

source: **video_filter.output** - default video filters for output, string [filter1,filter2,filter3,...]
pl: **video_filter.output** - domyślne filtry video dla wyjścia, string [filtr1,filtr2,filtr3,...]

source: The analogous configuration for the web application is in the file **config.js** located in the **Web** directory.
pl: Analogiczna konfiguracja dla aplikacji webowej znajduje się w pliku **config.js** znajdującym się w katalogu **Web**.

source: Software - technical data
pl: Software - dane techniczne

source: Libraries used
pl: Użyte biblioteki

source: AI models used
pl: Użyte modele AI

source: Movenet (human motion detection):
pl: Movenet (detekcja ruchu człowieka):

source: Mobilenet (object classification):
pl: Mobilenet (klasyfikacja obiektów):
