Repository: szczyglis-dev/py-gpt
Catalog: docs/source/locale/*/LC_MESSAGES/addons.po
Languages: pl

source: Requirements Python 3.10 (for Python sources)
pl: Wymagania Python 3.10 (dla źródeł w Pythonie)

source: Configuration of GPIO pins - Raspberry
pl: Konfiguracja pinów GPIO – Raspberry

source: Pin addressing mode: **GPIO.BOARD**
pl: Tryb adresowania pinów: **GPIO.BOARD**

source: The configuration is in the **config.ini** file in the root directory of client application:
pl: Konfiguracja znajduje się w pliku **config.ini** w katalogu głównym aplikacji klienckiej:

source: Configuration of GPIO pins - Arduino
pl: Konfiguracja pinów GPIO – Arduino

source: **PIN 11** – Y SERVO (PWM)
pl: **PIN 11** – SERVO Y (PWM)

source: The configuration is in a single code file for the application Arduino client:
pl: Konfiguracja znajduje się w pojedyńczym pliku z kodem dla aplikacji klienckiej Arduino:

source: Format of commands sent to the serial port
pl: Format wysyłanych komend na port szeregowy

source: In the case of a serial connection, the syntax sent to the command port looks like this:
pl: W przypadku połączenia szeregowego składnia wysyłanej na port komendy wygląda następująco:

source: where:
pl: gdzie po kolei:

source: **X** – X servo movement value (angle)
pl: **X** – wartość wychylenia serwa X (w stopniach)

source: **Y** – Y servo movement value (angle)
pl: **Y** – wartość wychylenia serwa Y (w stopniach)

source: **C** - the number of detected objects by AI (if the mode auto/AI, with manual it always equals 0)
pl: **C** – ilość wykrytych obiektów na ekranie (jeśli tryb automatyczny/AI, przy manualnym = 0)

source: **1** - state of A1 (0 or 1)
pl: **1** – stan akcji A1 (0 lub 1)

source: **2** - state of A2 (0 or 1)
pl: **2** – stan akcji A2 (0 lub 1)

source: **3** - state of A3 (0 or 1)
pl: **3** – stan akcji A3 (0 lub 1)

source: **4** – state of B4 (0 or 1)
pl: **4** – stan akcji B4 (0 lub 1)

source: **5** - state of B5 (0 or 1)
pl: **5** – stan akcji B5 (0 lub 1)

source: **6** - state of B6 (0 or 1)
pl: **6** – stan akcji B6 (0 lub 1)

source: An example command sent to the serial port:
pl: Przykładowa komenda wysyłana na port szeregowy:

source: meaning in turn:
pl: oznaczająca po kolei:

source: servo movement X = 30 degrees
pl: wychylenie serwa X = 30 stopni

source: servo movement Y = 120 degrees
pl: wychylenie serwa Y = 120 stopni

source: 1 detected object
pl: 1 wykryty obiekt

source: active action A2 (state = 1)
pl: aktywna akcja A2 (stan = 1)

source: rest of actions (A1, A3, B4, B5, B6) are disabled (state = 0).
pl: pozostałe akcje (A1, A3, B4, B5, B6) są wyłączone (stan = 0).

source: The end of command character is a newline character: **\\n**
pl: Znak końca komendy to znak nowej linii: **\\n**

source: Command ``0`` (zero) sent to the serial port (Arduino) sends request for status response of the device/sensors.
pl: Komenda ``0`` (zero) wysłana na port szeregowy (Arduino) powoduje odpytanie o status urządzenia/sensorów.

source: **The above can be used to program your own controller using a serial / UART / USB port to connect.**
pl: **Powyższe można wykorzystać do oprogramowania własnego sterownika używającego do połączenia portu szeregowego / UART / USB.**

source: **Tip:** The command format above can be used to manually send a command to the servo. To do this, just connect the servos to, for example, Arduino, and then, using the Arduino IDE, send the appropriate command to the Arduino serial port (using Arduino Serial Port Monitor and the USB connector).
pl: **Tip:** powyższego formatu wysyłanych komend można użyć do ręcznego wysłania polecenia do serwomechanizmu. Aby to zrobić wystarczy podłączyć serwomechanizmy do np. Arduino, a następnie np. za pomocą Arduino IDE wysłać odpowiednią komendę na port szeregowy Arduino (za pomocą złącza USB).

source: Troubleshooting
pl: Rozwiązywanie problemów

source: **Unable to connect from another device**
pl: **Nie można połączyć się z innego urządzenia**

source: Only one server application can be connected to the remote client at a time - to enable connection from a different IP, you must first disconnect from the previous application. Connecting multiple apps at once will be addressed in future releases.
pl: W danej chwili podłączona do zdalnego klienta może być tylko jedna aplikacja serwerowa - aby umożliwić połączenie z innego IP, należy uprzednio rozłączyć się z poprzedniej aplikacji. Podłączenie wielu aplikacji naraz zostanie rozwiązane w przyszłych wydaniach.

source: **Lost connection with the client**
pl: **Utrata połączenia z klientem**

source: It may happen that for various reasons the connection is broken or the client application stops responding - if this happens, it should be restarted on the client machine, or it is best to use software that supervises running applications, such as Supervisor.
pl: Może się zdarzyć, że z różnych powodów połączenie zostanie zerwane, lub aplikacja kliencka przestanie odpowiadać - jeśli się to zdarzy, należy uruchomić ją ponownie na maszynie klienta, lub najlepiej używać do tego celu oprogramowania nadzorującego uruchomione aplikacje, takiego jak np. Supervisor.

source: **No smooth movement of servos connected remotely**
pl: **Brak płynności w ruchu serwomechanizmów podłączonych zdalnie**

source: Depending on the speed of your connection (if it is a WIFI connection), there may be delays in sending commands and video stream. To adjust the bandwidth to your connection, you can try to reduce the resolution of the transmitted video on the client side, enable JPEG compression, or try to disable other applications that are currently using the network and generating a large load.
pl: W zależności od prędkości posiadanego połączenia (jeśli to połączenie WIFI) mogą pojawić się opóźnienia w przesyłaniu komend i obrazu wideo. Aby dostosować przepustowość do swojego łącza można spróbować zmniejszyć rozdzielczość przesyłanego obrazu wideo po stronie klienta, włączyć kompresję JPEG, lub spróbować wyłączyć inne aplikacje używające w danej chwili sieci i generujące duże obciążenie sieci.

source: **Delays (lags) when connecting to the client**
pl: **Opóźnienia podczas połączenia z klientem**

source: Remote connection will always generate delays, they will vary depending on the infrastructure you have. The software architecture is prepared in such a way that these delays are as small as possible, however, some physical aspects cannot be overcome and a delay of several dozen milliseconds will always occur. Additional delay may be generated by the client's computer, depending on the computing power it has (e.g. Raspberry 3 will react slower than Raspberry 4). Only a local connection allows you to work without visible transfer delays.
pl: Połączenie zdalne zawsze będzie generować opóźnienia, będą różne w zależności od posiadanej infrastruktury. Architektura oprogramowania jest przygotowana w taki sposób, aby te opóźnienia były jak najmniejsza, jednakże pewnych aspektów fizycznych przeskoczyć się nie da i opóźnienie na poziomie kilkudziesięciu milisekund występować będzie zawsze. Dodatkowe opóźnienie generować może komputer klienta, w zależności od posiadanej mocy obliczeniowej (np. Raspberry 3 reagować będzie wolniej, niż Raspberry 4). Jedynie połączenie lokalne pozwala na pracę bez widocznych opóźnień w transferze.

source: **GPU detection issues**
pl: **Problemy z wykrywaniem GPU**

source: The software can run on both GPU and CPU. In the absence of a suitable GPU, all calculations will be performed on the CPU. If the graphics card with GPU is not detected by the software, make sure that it is compatible with Tensor Flow and that the appropriate CUDA libraries are installed in the operating system (details of installing CUDA libraries can be found on the Nvidia website or in the tutorials available on web).
pl: Oprogramowanie może działać zarówno na GPU jak i na CPU. W przypadku braku odpowiedniego GPU wszystkie obliczenia dokonywane będą na CPU. Jeśli karta graficzna z GPU nie jest wykrywana przez oprogramowanie należy upewnić się, czy jest kompatybilna z Tensor Flow oraz czy w systemie operacyjnym są zainstalowane odpowiednie biblioteki CUDA (szczegóły instalacji bibliotek CUDA znajdują się na stronach WWW firmy Nvidia i w tutorialach dostępnych w internecie).

source: **The servo does not respond well to control commands**
pl: **Serwomechanizm źle reaguje na komendy sterujące**

source: It may happen that the motion to the servo is transmitted incorrectly despite the correct commands being sent. The cause may be an incorrect configuration of the servo control pulses. You should then properly configure these options by setting the parameters appropriate for your servo model. These parameters should be configured in the file with the code for Arduino (if the control is done using Arduino), or in the client's ``config.ini`` file (if the control is done using the Raspberry GPIO).
pl: Może się zdarzyć, że ruch do serwomechanizmu przekazywany jest w sposób niepoprawny pomimo przesyłania prawidłowych komend. Przyczyną może być nieodpowiednia konfiguracja impulsów sterujących serwomechanizmem. Należy wtedy odpowiednio skonfigurować te opcje ustawiając parametry odpowiednie dla posiadanego modelu serwomechanizmu. Parametry te należy skonfigurować w pliku z kodem dla Arduino (jeśli sterowanie odbywa się za pomocą Arduino), lub w pliku ``config.ini`` klienta (jeśli sterowanie odbywa się za pomocą GPIO Raspberry).

source: **Unable to connect via serial port**
pl: **Nie można uzyskać połączenia poprzez port szeregowy**

source: It may happen that the serial (USB) port you are trying to use to establish a connection with e.g. Arduino cannot be opened. Make sure that no other application is already using this port. If this is the case, release the port in the other application and try to connect again. A port already in use by one application cannot be used by another application.
pl: Może się zdarzyć, że port szeregowy (USB), którego próbujesz użyć do nawiązania połączenia np. z Arduino nie może zostać otwarty. Należy upewnić się wtedy, czy żadna inna aplikacja nie używa już tego portu. Jeśli ma to miejsce to należy zwolnić port w drugiej aplikacji i spróbować połączyć się ponownie. Port używany już przez jedną aplikację, nie może być używany przez drugą aplikację.

source: Change log
pl: Dziennik zmian

source: Server app
pl: Server - aplikacja serwerowa

source: added "live" servo configurator
pl: dodano okno z konfiguracją parametrów serwa

source: fixed wrong delta to angle Y axis calculation
pl: poprawione: błędne przeliczanie ruchu na oś Y

source: fixed clients list parsing on config save
pl: poprawione: parsowanie listy klientów podczas zapisu konfiguracji

source: added GPU support to Windows version
pl: dodane wsparcie dla GPU w wersji Windows

source: added webstream connections
pl: dodane połączenia typu "stream"

source: added overlay labels
pl: dodane overlaye na labelu video

source: added continous and toggle actions control via keyboard
pl: dodane sterowanie ciągłe i przełączające akcjami za pomocą klawiatury

source: added window UI sliders
pl: dodane slidery w UI

source: added logo, website url and updater
pl: dodane logo, www i sprawdzanie aktualizacji

source: fixed connection core between sockets
pl: poprawione: połączenia między socketami

source: fixed high CPU usage after remote disconnect
pl: poprawione: wysokie użycie CPU po rozłączeniu klienta

source: fixed serial port disconnect handling
pl: poprawione: obsługa portu szeregowego

source: added ping and socket responses for device commands
pl: dodana opcja ping i odpowiedzi na komendy poprzez sockety

source: added performance debug info
pl: dodany debug wydajności

source: added options tab
pl: dodana zakładka "Opcje"

source: added config save option
pl: dodana możliwość zapisu konfiguracji z poziomu aplikacji

source: initial beta version
pl: pierwsza beta wersja

source: Client app
pl: Client - aplikacja kliencka

source: small fixes
pl: małe poprawki

source: fix: socket disconnecting
pl: poprawione: rozłączanie socketów

source: fix: socket restarting
pl: poprawione: restartowanie socketów

source: added ping timestamps and socket responses for device commands
pl: dodane znaczniki czasowe do przesyłanych danych

source: added socket config options
pl: dodane opcje konfiguracyjne dla socketów

source: added serial port auto-reconnecting after disconnect
pl: dodane automatyczne wznawianie połączenia po rozłączeniu portu szeregowego

source: added logging to log files
pl: dodane logowanie zdarzeń i błędów do plików

source: added loop socket
pl: dodany socket zwrotny

source: initial version
pl: pierwsza beta wersja

source: Credits / license
pl: Autorzy / Licencja

source: Software released under the MIT license:
pl: Oprogramowanie udostępnione na licencji MIT:
