Repository: szczyglis-dev/py-gpt
Catalog: docs/source/locale/*/LC_MESSAGES/software.po
Languages: pl

source: This is not critical on a trusted local network, but when transferring over a public network, you should secure the data being sent over the network. The software has implemented the ability to encrypt the video image transmitted over the network. To enable image encryption for remote connections when sending an image to a desktop application, enable the **security.aes.video** option in **config.ini** file:
pl: Nie jest to krytyczne w zaufanej sieci lokalnej, ale podczas transferu przez sieć publiczną należy zabezpieczyć przesyłane przez sieć dane. W oprogramowaniu zaimplementowano możliwość szyfrowania obrazu wideo przesyłanego przez sieć. Aby włączyć szyfrowanie obrazu dla połączeń zdalnych przy wysyłaniu obrazu na aplikację desktopową należy włączyć opcję **security.aes.video** znajdującą się w **config.ini**:

source: The above parameter enables video encryption for remote mode (desktop application).
pl: Powyższy parametr włącza szyfrowanie obrazu wideo dla trybu zdalnego (aplikacji desktopowej).

source: Using a separate parameter, you can also enable encryption of the transmitted control data (sent via network sockets). To enable encryption of such data as well, enable the **security.aes.data** option:
pl: Za pomocą oddzielnego parametru można włączyć również szyfrowanie przesyłanych danych sterujących (przesyłanych przez sockety sieciowe). Aby włączyć szyfrowanie również i takich danych, należy włączyć opcję **security.aes.data**:

source: If encryption is enabled, you must also provide any random, **16-character key** with which data will be encrypted using the **AES cryptographic algorithm**:
pl: Jeśli włączono szyfrowanie to należy także podać dowolny, losowy, **16-znakowy klucz** za pomocą którego szyfrowane będą dane za pomocą algorytmu kryptograficznego **AES**:

source: Securing traffic for a web application is different - it requires specifying a special **token** that will be required to connect to the webserver. This token should be as random as possible, it is best to use some generator available online to generate a maximum random string of characters, e.g. you can use: https://generate-random.org/api-token-generator
pl: Zabezpieczenie ruchu dla aplikacji webowej odbywa się inaczej – wymaga określenia specjalnego **tokena**, który będzie wymagany do połączenia się z webserwerem. Token ten powinien być jak najbardziej losowy, najlepiej skorzystać z jakiegoś generatora dostępnego online, aby wygenerować maksymalnie losowy ciag znaków, np. można skorzystać z: https://generate-random.org/api-token-generator

source: The token must then be specified in the **config.ini** file:
pl: Token należy następnie podać w pliku **config.ini**:

source: To connect to a client that has token-secured access, the token must be attached to the address using the **?token=** parameter:
pl: Aby połączyć się z klientem, który posiada zabezpieczony tokenem dostęp, token musi być załączany do adresu, za pomocą parametru **?token=**.

source: E.g.:
pl: Np.:

source: If the token is defined and is not provided in the address, or an incorrect token is provided, the connection will be rejected (HTTP code 403 Forbidden).
pl: Jeśli token jest zdefiniowany, a nie zostanie podany w pasku adresu, lub podany zostanie niepoprawny token to połączenie zostanie odrzucone (kod HTTP 403 Forbidden).

source: **Note:** if you set the access token in the web option, you should also configure it in the web application - this should be done in the ``config.js`` configuration file located in the directory with the web application, in the option ``security > webToken``:
pl: **Uwaga #1:** w przypadku ustawienia tokena dostępowego w opcji webowej należy skonfigurować go również w aplikacji webowej – należy to zrobić w pliku konfiguracyjnym **config.js** znajdującym się w katalogu z aplikacją webową, w opcji:

source: **Note:** Encrypting data may slow down your connection slightly, introduce latency, and cause higher CPU usage, especially on low-end devices like the Raspberry.
pl: **Uwaga #2:** szyfrowanie danych może nieznacznie spowolnić połączenie, wprowadzić opóźnienia i spowodować większe użycie procesora, szczególnie na słabych urządzeniach, typu Raspberry.

source: When connecting over a public network, it is also worth considering additional measures, such as Wireguard, HTTPS encrypted connection, or IP tunneling.
pl: Podczas połączeń wykonywanych przez sieć publiczną warto również rozważyć dodatkowe środki, takie jak Wireguard, połączenie szyfrowane HTTPS, czy tunelowanie IP.

source: Device status - reading from sensors, sending status to the server
pl: Status urządzenia – odczyt z sensorów, wysyłka na serwer

source: Using the client, you can prepare your own device status, which will then be sent remotely to the server application. Thanks to this, you can have remote access to the state of the machine (e.g. readings from sensors) at all time. Own status can be defined both in the Python version for Raspberry and PC, as well as in the version for Arduino.
pl: Za pomocą klienta można przygotować własny status urządzenia, który będzie następnie wysyłany zdalnie do aplikacji serwerowej. Dzięki temu można przez cały czas posiadać zdalny dostęp do stanu maszyny (np. odczytu z sensorów). Własny status można zdefiniować zarówno w wersji pythonowej dla Raspberry i PC, jak i w wersji dla Arduino.

source: Raspberry and PC
pl: Raspberry i PC

source: The client version for Raspberry and PC has a python class **Status** in the client's main directory.
pl: Klient w wersji dla Raspberry i PC posiada w głównym katalogu pythonową klasę **Status**.

source: It is defined in the **status.py** file and contains two methods for your own use:
pl: Znajduje się w pliku **status.py** i zawiera dwie metody przeznaczone do własnego użytku:

source: In the first method - ``init()``, you can define actions launched during device startup, such as setting the appropriate pins for sensors or other required startup procedures. The method is called at client startup, after **GPIO.setmode(GPIO.BOARD)** has been initialized.
pl: W pierwszej metodzie - **init()** zdefiniować można akcje uruchamiane podczas startu urządzenia, takie jak np. ustawienie odpowiednich pinów dla sensorów, czy inne wymagane startowe procedury. Metoda jest wywoływana podczas uruchamiania klienta, po zainicjowaniu trybu **GPIO.setmode(GPIO.BOARD)**.

source: Example of use:
pl: **Przykład:**

source: In the second method - ``get_status()`` , a string with the device status is returned, any string can be prepared here, containing, for example, the current time or sensor readings.
pl: W drugiej metodzie - **get_status()** zwracany jest string ze statusem urządzenia, można tutaj przygotować dowolny ciąg, zawierający np. aktualny czas, czy odczyty z sensorów.

source: In the class you also have access to the status of the device sent via the serial port (if, for example, the device is connected via Arduino). To access this status, just read the string value:
pl: W klasie posiada się także dostęp do statusu urządzenia wysyłanego przez port szeregowy (jeśli np. urządzenie podłączone jest za pomocą Arduino). Aby uzyskać dostęp do tego statusu wystarczy odczytać wartość string:

source: e.g.
pl: np.

source: To add your own status, add your code to the **get_status()** function.
pl: Aby dodać własny status należy dodać swój kod do funkcji **get_status().**.

source: You can receive, for example, data from sensors and return it for sending to the server application.
pl: Można w niej odebrać np. dane z sensorów i zwrócić z powrotem do wysyłki na aplikację serwerową.

source: The function must return a **String** object.
pl: Funkcja musi zwracać obiekt typu **String**.

source: Updating to newer versions
pl: Aktualizacje do nowszych wersji

source: The current version of the software is always available for download on the project website.
pl: Aktualna wersja oprogramowania dostępna jest zawsze do pobrania na stronie WWW projektu.

source: When upgrading from an older version to a newer version, it is always a good idea to ensure that the version of the server software matches the version of the client software. Appropriate versions of both server and client are always in the archive with a given version. The required versions are also always listed on GitHub - for example, to check what client version the server software requires in its current version, just look at the ``README.md`` file located on GitHub in the root directory of the repository:
pl: Podczas dokonywania aktualizacji oprogramowania ze starszej wersji do nowszej warto zawsze pamiętać, aby wersja oprogramowania serwerowego pasowała do wersji oprogramowania klienckiego. Odpowiednie wersje zarówno serwera jak i klienta znajdują się zawsze w archiwum z daną wersją. Wymagane wersje są ponadto zawsze podane na GitHubie - aby przykładowo sprawdzić jakiej wersji klienta wymaga oprogramowanie serwerowe w swojej obecnej wersji, wystarczy zajrzeć do pliku ``README.md`` znajdującego się na GitHub-ie w katalogu głównym repozytorium:

source: Similarly, to check what version of server software a given client version requires, check its requirements in the repository:
pl: Analogicznie, aby sprawdzić jakiej wersji oprogramowania serwerowego wymaga dana wersja klienta, należy sprawdzić jej wymagania w repozytorium:

source: Updating the client software - if it is on a remote Raspberry - can be done remotely by logging into a Raspberry connected to the network, e.g. using SSH. The update usually consists only of replacing old files with new ones and restarting the running software or device. If additional steps are required (such as installing additional libraries) it will always be described in the manual.
pl: Aktualizacji oprogramowania klienckiego - jeśli znajduje się na zdalnym Raspberry - można dokonywać zdalnie, logując się na podłączone do sieci Raspberry np. za pomocą SSH. Aktualizacja polega zazwyczaj jedynie na podmianie starych plików na nowe i na restarcie uruchomionego oprogramowania lub urządzenia. Jeśli wymagane będą dodatkowe kroki (takie jak np. instalacja dodatkowych bibliotek) to będzie to zawsze opisane w instrukcji.

source: When updating the client software, remember to modify your configuration file ``config.ini`` located in the main directory of the client. It's best to just not overwrite the old ``config.ini`` file - if it is necessary to replace it (e.g. its format changes or additional configuration options appear) it will always be described in the manual - in any other case you can use the old one, already configured ``config.ini`` file.
pl: Przy aktualizacji oprogramowania klienckiego należy pamiętać o odpowiednim zmodyfikowaniu swojego pliku konfiguracyjnego ``config.ini`` znajdującego się w katalogu głównym klienta. Najlepiej po prostu nie nadpisywać starego pliku ``config.ini`` - jeśli będzie konieczna jego podmiana (np. zmieni się jego format lub pojawią się dodatkowe opcje konfiguracyjne) to będzie to zawsze opisane w instrukcji - w każdym innym przypadku można użyć starego, już skonfigurowanego pliku ``config.ini``.

source: Configuration files for the server application are stored in the user's directory - updating the software to the new version of the application does not overwrite them - they are shared between different versions of the application.
pl: Pliki konfiguracyjne dla aplikacji serwerowej są przechowywane w katalogu użytkownika - aktualizacja oprogramowania do nowej wersji aplikacji nie nadpisuje ich - są współdzielone pomiędzy różnymi wersjami aplikacji.
