Repository: szczyglis-dev/py-gpt
Catalog: docs/source/locale/*/LC_MESSAGES/software.po
Languages: pl

source: Such configuration will automatically start the supervisor during device startup, then autostart the client and supervise it with the help of the supervisor, who from now on will always watch if the client is still running and will restart it in case of any problems.
pl: Taka konfiguracja spowoduje automatyczny start supervisora podczas startu urządzenia, następnie autostart klienta i nadzór nad nim za pomocą supervisora, który będzie od tej pory przez cały czas czuwał, czy klient pozostaje ciągle uruchomiony i w razie jakichkolwiek problemów zrestartuje go.

source: For more informations about using Supervisor, please visit: `https://supervisord.org <https://supervisord.org/>`__
pl: Więcej informacji odnośnie korzystania z supervisora znajduje się na stronie: `https://supervisord.org <https://supervisord.org/>`__

source: Below is a description of the client configuration options found in the **config.ini** file located in the root directory of the client application:
pl: Poniżej znajduje się opis opcji konfiguracyjnych klienta znajdujących się w pliku **config.ini** znajdującym się w katalogu głównym z aplikacją kliencką:

source: **security.web.token** - security token for web applications, string
pl: **security.web.token** - token zabezpieczający dla webaplikacji, string

source: **security.aes.video** - on/off video data encryption using AES during connection, bool [1|0] (1)
pl: **security.aes.video** - wł/wył. szyfrowanie obrazu video za pomocą AES podczas połączenia, bool [1|0] (1)

source: **security.aes.data** - on/off data encryption with AES during connection, bool [1|0] (1)
pl: **security.aes.data** - wł/wył. szyfrowanie danych za pomocą AES podczas połączenia, bool [1|0] (1)

source: **security.aes.key** - 16-character secret encryption key, must be the same on the client and on the server, string
pl: **security.aes.key** - 16 znakowy tajny klucz szyfrujący, musi być taki sam na kliencie i na serwerze, string

source: **log.info.enabled** - on/off logging info to file, bool [1|0] 0
pl: **log.info.enabled** = wł./wył. logowanie info do pliku, bool [1|0] (0)

source: **log.info.file** - log file, string (info.log)
pl: **log.info.file** = plik z logami, string (info.log)

source: **log.error.enabled** - on/off log errors to file, bool [1|0] 1
pl: **log.error.enabled** = wł./wył. logowanie błędów do pliku, bool [1|0] (1)

source: **log.error.file** - error log file, string (error.log)
pl: **log.error.file** = plik z logami błędów, string (error.log)

source: **client.ip** - client socket IP, string (0.0.0.0)
pl: **client.ip** - IP dla socketa klienta, string (0.0.0.0)

source: **client.hostname** - custom hostname, string
pl: **client.hostname** - customowa nazwa hosta, string

source: **client.device** - type of connected device [raspberry|arduino], string (arduino)
pl: **client.device** - rodzaj podłączonego urządzenia [raspberry|arduino], string (arduino)

source: **client.port.data** - port for data and command transmission, integer (6666)
pl: **client.port.data** - port dla transmisji danych i komend, integer (6666)

source: **client.port.conn** - connection initiation port, integer (6667)
pl: **client.port.conn** - port dla inicjowania połączenia, integer (6667)

source: **client.port.status** - port for receiving status from the device, integer (6668)
pl: **client.port.status** - port dla odbioru statusu z urządzenia, integer (6668)

source: **client.port.web** - port for video streaming in the webserver option, integer (8888)
pl: **client.port.web** - port dla streamingu obrazu w opcji webserver, integer (8888)

source: **client.port.video** - port for video streaming in desktop option, integer (5555)
pl: **client.port.video** - port dla streamingu obrazu w opcji desktop, integer (5555)

source: **client.socket.pull.wait** - receiving socket wait option, bool [1|0] (0)
pl: **client.socket.pull.wait** = opcja socketa odbierajacego dane, bool [1|0] (0)

source: **client.socket.pull.linger** - receiving socket linger option, bool [1|0] (0)
pl: **client.socket.pull.linger** = opcja socketa odbierajacego dane, bool [1|0] (0)

source: **client.socket.push.wait** - sending socket wait option, bool [1|0] (0)
pl: **client.socket.push.wait** = opcja socketa wysyłającego dane, bool [1|0] (0)

source: **client.socket.push.linger** - push socket linger option, bool [1|0] (1)
pl: **client.socket.push.linger** = opcja socketa wysyłającego dane, bool [1|0] (1)

source: **client.web** - on/off video stream for web application, bool [1|0] (0)
pl: **client.web** - wł/wył. stream obrazu dla aplikacji webowej, bool [1|0] (0)

source: **client.server.ip** - IP address of the default server, string
pl: **client.server.ip** - adres IP domyślnego serwera, string

source: **client.camera.idx** - default camera idx, integer (0)
pl: **client.camera.idx** – nr. domyślnej kamery, integer (0)

source: **client.camera.use_pi** - on/off Raspberry Pi camera (CSI), bool [1|0] (0)
pl: **client.camera.use_pi** - wł/wył. pobieranie obrazu z kamery Raspberry Pi, bool [1|0] (0)

source: **client.camera.width** - width of the captured video in px, integer
pl: **client.camera.width** - szerokość przechwytywanego obrazu w px, integer

source: **client.camera.height** - height of the captured video in px, integer
pl: **client.camera.height** - wysokość przechwytywanego obrazu w px, integer

source: **client.verbose** - on/off displaying status messages in the console, bool [1|0] (0)
pl: **client.verbose** - wł/wył. wyświetlanie komunikatów ze statusem w konsoli, bool [1|0] (0)

source: **client.debug** - on/off displaying debug messages in the console, bool [1|0] (0)
pl: **client.debug** - wł/wył. wyświetlanie komunikatór developerskich w konsoli, bool [1|0] (0)

source: **client.silent** - on/off silent mode, disables console output, bool [1|0] (0)
pl: **client.silent** - wł/wył. tryb cichy, bez logowania do konsoli, bool [1|0] (0)

source: **client.status.check** - on/off querying device status, bool [1|0] (0)
pl: **client.status.check** - wł/wył. odpytywanie o stan urządzenia, bool [1|0] (0)

source: **client.status.interval** - second interval for querying the device status, integer (3)
pl: **client.status.interval** - odstęp sekundowy dla odpytywanie o stan urządzenia, integer (3)

source: **client.stream.jpeg** - on/off video compression during streaming, bool [1|0] (0)
pl: **client.stream.jpeg** - wł/wył. kompresję obrazu podczas streamingu, bool [1|0] (0)

source: **client.stream.jpeg.quality** - defines JPEG compression ratio when enabled, integer (85)
pl: **client.stream.jpeg.quality** - określa współczynnik kompresji JPEG, gdy właczona, integer (85)

source: **client.stream.resize** - on/off scaling the video during streaming, specify the width in px, or leave it empty, int
pl: **client.stream.resize** - wł/wył. skalowanie obrazu podczas streamingu, należy podać szerokość w px, lub zostawić puste, int

source: **client.device.arduino.serial** - serial (input) port for PC/Raspberry connection, string (/dev/ttyUSB0)
pl: **client.device.arduino.serial** - port szeregowy (wejściowy) dla połączenia z komputerem/Raspberry, string (/dev/ttyUSB0)

source: **client.device.arduino.data_format** - format of data sent to the device, JSON or RAW, string (RAW)
pl: **client.device.arduino.data_format** - format wysyłanych do urządzenia danych, JSON lub RAW, string (RAW)

source: **client.device.raspberry.serial.input** - serial (input) port for connecting to the server, string (/dev/ttyS0)
pl: **client.device.raspberry.serial.input** = port szeregowy (wejściowy) dla połaczenia z komputerem, string (/dev/ttyS0)

source: **client.device.raspberry.serial.output** - serial (output) port for connection to the device, e.g. Arduino, string (/dev/ttyUSB0)
pl: **client.device.raspberry.serial.output** = port szeregowy (wyjściowy) dla połączenie z urządzeniem, np. Arduino, string (/dev/ttyUSB0)

source: **client.device.raspberry.mode.input** - input connection mode, network or serial, string [network|serial] (network)
pl: **client.device.raspberry.mode.input** = tryb połączenia wejściowego, sieć lub port szeregowy, string [network|serial] (network)

source: **client.device.raspberry.mode.output** - device control mode, via built-in GPIO, or using an Arduino connected via a serial port, string [gpio|serial] (serial)
pl: **client.device.raspberry.mode.output** = tryb sterowania urządzeniem, poprzez wbudowane GPIO, lub za pomocą podłączonego np. Arduino poprzez port szeregowy, string [gpio|serial] (serial)

source: **client.device.raspberry.data_format** - format of data sent to the device, JSON or RAW, string (RAW)
pl: **client.device.raspberry.data_format** - format wysyłanych do urządzenia danych, JSON lub RAW, string (RAW)

source: **client.device.raspberry.pin.servo_x** - pin for X servo, board address, integer (32)
pl: **client.device.raspberry.pin.servo_x** - pin dla serwa X, adres na płytce, integer (32)

source: **client.device.raspberry.pin.servo_y** - pin for servo Y, address on the board, (33)
pl: **client.device.raspberry.pin.servo_y** - pin dla serwa Y, adres na płytce, (33)

source: **client.device.raspberry.pin.action_A1** - pin for action #1, address on the board, (16)
pl: **client.device.raspberry.pin.action_A1** - pin dla akcji #1, adres na płytce, (16)

source: **client.device.raspberry.pin.action_A2** - pin for action #2 address on the board, (18)
pl: **client.device.raspberry.pin.action_A2** - pin dla akcji #2 adres na płytce, (18)

source: **client.device.raspberry.pin.action_A3** - pin for action #3 address on the board, (22)
pl: **client.device.raspberry.pin.action_A3** - pin dla akcji #3 adres na płytce, (22)

source: **client.device.raspberry.pin.action_B4** - pin for action #4, address on the board, (24)
pl: **client.device.raspberry.pin.action_B4** - pin dla akcji #4, adres na płytce, (24)

source: **client.device.raspberry.pin.action_B5** - pin for action #5, address on the board, (26)
pl: **client.device.raspberry.pin.action_B5** - pin dla akcji #5, adres na płytce, (26)

source: **client.device.raspberry.pin.action_B6** - pin for action #6, address on the board, (36)
pl: **client.device.raspberry.pin.action_B6** - pin dla akcji #6, adres na płytce, (36)

source: **serial.baud_rate** - serial port baud rate, integer (9600)
pl: **serial.baud_rate** = prędkosć przesyłania przez port szeregowy, integer (9600)

source: **serial.data.format** - sent data format, string [JSON|RAW] (RAW)
pl: **serial.data.format** = format wysyłanych danych, string [JSON|RAW] (RAW)

source: **servo.use_limit** - on/off movement mapping according to the limit value, instead of max angle, bool [1|0] (0)
pl: **servo.use_limit** = wł/wył. mapowanie ruchu wg wartości limitu, zamiast max angle, bool [1|0] (0)

source: **servo.angle.start.x** - initial deflection angle of the servo in the X axis, integer (90)
pl: **servo.angle.start.x** - inicjalne wychylenie serwomechanizmu w osi X, integer (90)

source: **servo.angle.start.y** - initial deflection angle of the servo in the Y axis, integer (90)
pl: **servo.angle.start.y** - inicjalne wychylenie serwomechanizmu w osi Y, integer (90)

source: **servo.angle.min.x** - min. deflection angle of the servo in the X axis, integer (0) # servo parameter
pl: **servo.angle.min.x** - min. wychylenie serwomechanizmu w osi X, integer (0) # parametr serwa

source: **servo.angle.min.y** - min. deflection angle of the servo in the Y axis, integer (0) # servo parameter
pl: **servo.angle.min.y** - min. wychylenie serwomechanizmu w osi Y, integer (0) # parametr serwa

source: **servo.angle.max.x** - max. deflection angle of the servo in the X axis, integer (180) # servo parameter
pl: **servo.angle.max.x** - max. wychylenie serwomechanizmu w osi X, integer (180) # parametr serwa

source: **servo.angle.max.y** - max. deflection angle of the servo in the Y axis, integer (180) # servo parameter
pl: **servo.angle.max.y** - max. wychylenie serwomechanizmu w osi Y, integer (180) # parametr serwa

source: **servo.limit.min.x** - min. allowed servo movement in X axis, integer (0) # physical, real possibility
pl: **servo.limit.min.x** - min. dozwolony ruch serwomechanizmu w osi X, integer (0) # fizyczna, realna możliwość

source: **servo.limit.min.y** - min. allowed servo movement in Y axis, integer (0) # physical, real possibility
pl: **servo.limit.min.y** - min. dozwolony ruch serwomechanizmu w osi Y, integer (0) # fizyczna, realna możliwość

source: **servo.limit.max.x** - max. allowed servo movement in X axis, integer (180) # physical, real possibility
pl: **servo.limit.max.x** - max. dozwolony ruch serwomechanizmu w osi X, integer (180) # fizyczna, realna możliwość

source: **servo.limit.max.y** - max. allowed servo movement in Y axis, integer (180) # physical, real possibility
pl: **servo.limit.max.y** - max. dozwolony ruch serwomechanizmu w osi Y, integer (180) # fizyczna, realna możliwość

source: **servo.freq.x** - X-axis pulse frequency in Hz, integer (50)
pl: **servo.freq.x** = częstotliwość impulsów w Hz w osi X, integer (50)

source: **servo.freq.y** - Y-axis pulse frequency in Hz, integer (50)
pl: **servo.freq.y** = częstotliwość impulsów w Hz w osi Y, integer (50)

source: **servo.delay.x** - delay in milliseconds after moving the X axis, float (0.02)
pl: **servo.delay.x** = opóźnienie w milisekundach po wykonaniu ruchu w osi X, float (0.02)

source: **servo.delay.y** - delay in milliseconds after moving the Y axis, float (0.02)
pl: **servo.delay.y** = opóźnienie w milisekundach po wykonaniu ruchu w osi Y, float (0.02)

source: **servo.cycle.start.x** - starting value for the "duty cycle" in the X axis, float (0)
pl: **servo.cycle.start.x** - startowa wartość dla „duty cycle” w osi X, float (0)

source: **servo.cycle.start.y** - starting value for "duty cycle" in Y axis, float (0)
pl: **servo.cycle.start.y** - startowa wartość dla „duty cycle” w osi Y, float (0)

source: **servo.cycle.min.x** - min. value for "duty cycle" in X axis, float (2.5)
pl: **servo.cycle.min.x** - min. wartość dla „duty cycle” w osi X, float (2.5)

source: **servo.cycle.min.y** - min. value for "duty cycle" in Y axis, float (2.5)
pl: **servo.cycle.min.y** - min. wartość dla „duty cycle” w osi Y, float (2.5)

source: **servo.cycle.max.x** - max. value for "duty cycle" in the X axis, float (12.5)
pl: **servo.cycle.max.x** - max. wartość dla „duty cycle” w osi X ,float (12.5)

source: **servo.cycle.max.y** - max. value for "duty cycle" in Y axis, float (12.5)
pl: **servo.cycle.max.y** - max. wartość dla „duty cycle” w osi Y, float (12.5)

source: **servo.angle.step.x** - min. required difference in degrees to send command in X-axis, integer (1)
pl: **servo.angle.step.x** = min. wymagana różnica w stopniach dla wysłania komendy w osi X, integer (1)

source: **servo.angle.step.y** - min. required difference in degrees to send command in Y axis, integer (1)
pl: **servo.angle.step.y** = min. wymagana różnica w stopniach dla wysłania komendy w osi Y, integer (1)

source: **servo.angle.multiplier.x** - multiplier of steps in X axis, integer (1)
pl: **servo.angle.multiplier.x** - mnożnik kroków w osi X, integer (1)

source: **servo.angle.multiplier.y** - multiplier of steps in the Y axis, integer (1)
pl: **servo.angle.multiplier.y** - mnożnik kroków w osi Y, integer (1)

source: **Tip:** on Raspberry (older models, such as 3A, it is recommended to increase the size of the swap file to at least 1GB):
pl: **Tip:** na Raspberry (starszych modelach, jak np. 3A zalecane jest zwiększenie rozmiaru pliku wymiany, do min. 1GB):

source: and then in the **raspi-config** expand the filesystem to the entire SD card.
pl: ^ i następnie w **raspi-config** należy wybrać opcję rozszerzenia systemu plików na całą kartę SD.

source: Web application (web browser)
pl: Webaplikacja (przeglądarka WWW)

source: The web application is in the **Web** directory. This version of the application runs under the user's browser.
pl: Webaplikacja znajduje się w katalogu **Web**. Ta wersja aplikacji działa pod przeglądarką użytkownika.

source: The browser should have **GPU support", Google Chrome is recommended for best performance. To run the web application, you must first run a **webserver** on your computer - it can be any web server, such as **Nginx** or **Apache**, it can also be a simple development server available from Python. In the package, in the **Web** directory, there is a simple python framework/webserver - **Flask**, you can run it with:
pl: Przeglądarka powinna posiadać **wsparcie dla GPU** - zalecane jest używanie **Google Chrome** dla uzyskania najlepszej wydajności. Aby uruchomić webaplikację należy uprzednio uruchomić **serwer WWW** na komputerze - może to być dowolny serwer WWW, jak np. **Nginx**, czy **Apache**, może to być również prosty serwer deweloperski dostępny z poziomu Pythona. W pakiecie, w katalogu **Web** zawarty jest prosty pythonowy framework/webserwer - **Flask**, można uruchomić go za pomocą:

source: After starting, the webserver will be started and the web application will start automatically on port **8000**, at the address: `http://localhost:8000 <http://localhost:8000/>`__ **-** the number of port can be changed with the ``--port`` parameter , e.g.:
pl: Po uruchomieniu wystartowany zostanie webserwer, a aplikacja webowa uruchomi się automatycznie na porcie **8000**, pod adresem: `http://localhost:8000 <http://localhost:8000/>`__ **-** port można zmienić argumentem ``--port``, np.:

source: The interface of the web application differs from the desktop application, however, the operating modes and settings are similar to those in the desktop application.
pl: Aplikacja webowa różni się interfejsem od aplikacji okienkowej, jednakże tryby pracy i ustawienia są podobne do tych w aplikacji desktopowej.

source: **Modes of operation**
pl: **Tryb zdalny w webaplikacji**

source: The connection mode with the remote client (**REMOTE** option at the top of the screen) differs from the corresponding mode in the desktop application. To enable the connection in the web application, you need to run the client with the ``--web`` parameter:
pl: Tryb połączenia ze zdalnym klientem (opcja **REMOTE** na górze ekranu) różni się od analogicznego trybu z aplikacji desktopowej. Aby umożliwić połączenie w webaplikacji należy uruchomić klienta z argumentem ``--web=1``:

source: This causes sharing of the image from the camera as an **MJPEG** and serving it via the Flask framework, which then can be read by the browser. The image is then made available at the IP address of the device, e.g.:
pl: Powoduje to uruchomienie udostępniania obrazu z kamery jako obrazu **MJPEG** i serwowanie go poprzez framework Flask, który to obraz następnie możliwy jest do odczytu przez przeglądarkę. Obraz zostaje wtedy udostępniony pod adresem IP urządzenia, np.:

source: Port **8888** can be changed in the client's **config.ini** file:
pl: Port **8888** może być zmieniony w pliku **config.ini** klienta:

source: In the current version, the client application can be run either in **web** mode or in **default mode (IP sockets)**, it is not possible to run both modes at the same time.
pl: W obecnej wersji aplikacja kliencka może być uruchomiona albo w trybie **web**, albo w trybie **domyślnym (sockety IP)**, nie można uruchomić obu trybów naraz.

source: **Note:** remember to properly configure the access token in the ``config.js`` file if encryption/securing of data or access is enabled (more about this in the Security section).
pl: **Uwaga:** należy pamietać o odpowiednim skonfigurowaniu tokena dostępu w pliku config.js, jeśli włączono szyfrowanie/zabezpieczanie danych lub dostępu (więcej o tym w sekcji Bezpieczeństwo).

source: Access to the device from the public network
pl: Dostęp do urządzenia z sieci publicznej

source: The software and hardware in their standard configuration work only in the local network.
pl: Oprogramowanie i sprzęt w swojej standardowej konfiguracji działają jedynie w sieci lokalnej.

source: If there is a need to connect to the device via a public network (internet), traffic to the device must be redirected. To do this, redirect the ports on the router and unblock the ports used for communication by the client software on the firewall. The configuration of the router may differ depending on the router you have, but the whole thing boils down to redirecting the following ports on the router from the external network to the client device, which are opened on the client:
pl: Jeśli istnieje potrzeba podłączenia się do urządzenia poprzez sieć publiczną (internet) ruch do urządzenia musi zostać przekierowany. Aby to zrobić należy na routerze przekierować oraz odblokować na firewallu porty używane do komunikacji przez oprogramowanie klienckie. Konfiguracja routera może się różnić w zależności od posiadanego routera, jednakże całość sprowadza się jedynie do tego, aby na routerze przekierować z sieci zewnętrznej do urządzenia klienta następujące porty, które otwierane są na kliencie:

source: port **6666** - this is the socket receiving control commands from the server - *ZMQ / PULL*
pl: **port 6666** - jest to socket odbierający komendy sterujące z serwera – *ZMQ / PULL*

source: port **6667** - this is a temporary socket used to initiate the connection - *TCP / STREAM*
pl: **port 6667** - jest to tymczasowy socket używany do inicjacji połączenia – *TCP / STREAM*

source: and possibly:
pl: oraz ew.:

source: port **8888** - video stream in MJPEG format for WWW and receiving commands from the browser in the case of a running web client, or working in STREAM mode - *HTTP mode*
pl: port **8888** - stream obrazu wideo w formacie MJPEG dla WWW i odbieranie komend z przeglądarki w przypadku uruchomionego klienta webowego, lub pracy w trybie STREAM - *HTTP*

source: The following ports are opened (binded) on the server side:
pl: Po stronie serwera otwierane (bindowane) są następujące porty:

source: **5555** - for video transmission from the client to the server - *ZMQ*
pl: **5555** – do transmisji obrazu wideo od klienta do serwera - *ZMQ*

source: **6668** - for receiving status/data from the client - *ZMQ / PULL*
pl: **6668** – do odbierania statusu od klienta – *ZMQ / PULL*

source: The client ports must be forwarded from the router to the device with the client application, e.g. to the IP address of the Raspberry computer, if the client is a Raspberry. After redirecting the ports to the device, you will be able to connect from the public network by specifying the IP address of the router.
pl: Porty klienta muszą zostać przekierowane z routera na urządzenie z aplikacją kliencką, np. na adres IP komputera Raspberry, jeśli klientem jest Raspberry. Po przekierowaniu portów na urządzenie można będzie połączyć się z sieci publicznej podając adres IP routera.

source: The numbers of the ports can be changed in the **config.ini** file. Their default numbers are given below:
pl: Numerację używanych portów można zmienić w pliku **config.ini**, poniżej podane ich wartości domyślne:

source: Security - connection encryption
pl: Bezpieczeństwo - szyfrowanie połączenia

source: Data sent over the public network should be encrypted.
pl: Dane przesyłane przez sieć publiczną należy zaszyfrować.
