Repository: szczyglis-dev/py-gpt
Catalog: docs/source/locale/*/LC_MESSAGES/software.po
Languages: pl

source: It should be remembered that they must be given in a **normalized form** (as floating-point numbers between **0-1 range,** where **0 = the beginning of the coordinate system** and **1 = the end of the coordinate system**). When manually edit, then **X**, **Y** and **width** and **height** values needs to be defined.
pl: Należy przy tym pamiętać, że muszą być podane w postaci **znormalizowanej** (jako liczby zmiennoprzecinkowe z **zakresu 0-1,** gdzie **0 = początek układu współrzędnych**, a **1 = koniec układu**), przy ręcznym wpisywaniu należy podać **X**, **Y** oraz **szerokość** i **wysokość** dla rysowanego prostokąta.

source: Limiting filters
pl: Filtry ograniczające

source: In this tab, you can specify filters for the behavior during automatic control.
pl: W tej zakładce można podać filtry dla zachowania podczas sterowania automatycznego.

source: Here you can specify the classes of objects to which the operation will be limited, e.g. **person,car** (without spaces) and the minimum required score.
pl: Można tutaj podać klasy obiektów do których ograniczone będzie działanie, np. **person,car** (po przecinku, bez spacji) oraz minimalną wymaganą punktację.

source: You can specify constraints for several different types of events:
pl: Ograniczenia można podać dla kilku różnych typów zdarzeń:

source: **Detect** - the condition will be applied at the stage of object detection
pl: **Wykrywanie / Detect** – warunek będzie aplikowany na etapie wykrywania obiektów

source: **Tracking** - the condition will be applied at the stage of starting tracking
pl: **Śledzenie / Tracking** - warunek będzie aplikowany na etapie rozpoczynania śledzenia

source: **Action** - the condition will be applied when activating the action
pl: **Akcja / Action** - warunek będzie aplikowany podczas włączania wykonywania akcji

source: **Note:** Please note that not every AI model can classify objects, there is only one model in the package: Mobilenet. The Movenet model does not allow for classification, it is adapted only to the detection of human movement and each object detected by it will have the "person" class.
pl: **Uwaga:** należy pamiętać, iż nie każdy model AI umożliwia klasyfikację obiektów, w pakiecie jest tylko jeden model to potrafiący: Mobilenet. Model Movenet nie umożliwia klasyfikacji, jest przystosowany jedynie do wykrywanie ruchu człowieka i każdy wykryty przez niego obiekt będzie posiadał klasę „person”.

source: Options
pl: Opcje

source: In this tab you can configure basic parameters such as tracking speed, servo response and other parameters. There are basic options here, more options are in the configuration file.
pl: W tej zakładce można skonfigurować podstawowe parametry, takie jak szybkość śledzenia, reakcji serwa oraz inne parametry. Znajdują się tutaj podstawowe opcje, więcej opcji znajduje się w pliku konfiguracyjnym.

source: **Targeting**
pl: **Śledzenie / Targeting**

source: **Speed** - the speed at which the crosshair follows the target object
pl: **Speed** – prędkość podążąnia celownika za obiektem docelowym

source: **Delay** - delay in the execution of the next step after the target object
pl: **Delay** – opóźnienie w wykonaniu kolejnego kroku za obiektem docelowym

source: **Smooth** - The distance at which the tracking of the target slows down when approaching the object
pl: **Smooth** – odległość przy jakiej podążanie za obiektem docelowym zwalnia w momencie zbliżania się do obiektu

source: By setting different combinations of the above options, you can get different effects depending on your needs.
pl: Ustawiając różne kombinacje powyższych opcji można uzyskać różne efekty zależnie od potrzeb.

source: **Mean**
pl: **Wart. Średnia / Mean**

source: **Target** - enables calculation of the average position for the point of the target object (smooths to previous values)
pl: **Target** – włącza wyliczanie średniej pozycji dla punktu obiektu docelowego (wygładza do poprzednich wartości)

source: **Now** - enables calculation of the average position for the tracking point (smooths to previous values)
pl: **Now** – włącza wyliczanie średniej pozycji dla punktu śledzącego (wygładza do poprzednich wartości)

source: **Cam** - enables calculation of the average position for the camera point (smooths to previous values)
pl: **Cam** – włącza wyliczanie średniej pozycji dla punktu kamery (wygładza do poprzednich wartości)

source: The numerical inputs below determine how many previous values the algorithm should take into account when averaging positions.
pl: Inputy liczbowe poniżej określają jak dużo poprzednich wartości algorytm ma brać pod uwagę podczas uśredniania pozycji.

source: **Smooth**
pl: **Wygładzanie ruchu / Smooth**

source: **Follow** - smoothes the tracking motion
pl: **Follow** – wygładza ruch śledzenia

source: **Camera** - smoothes camera movement
pl: **Camera** – wygładza ruch kamery

source: **Brake** - causes the servo to be deactivated in the absence of a target object
pl: **Brake** – powoduje, że serwo jest deaktywowane w przypadku braku obiektu docelowego

source: **Step** - the distance to be covered in one step (the larger the faster the servo)
pl: **Step** – odległość do przebycia podczas jednego kroku (im większa tym szybszy ruch serwa)

source: **Resume** – the time in ms after which the patrol mode is to be resumed after the loss of the tracked object
pl: **Resume** – czas w ms po jakim od utraty obiektu śledzonego ma wznowić się tryb patrolu

source: **X / Y step** - every difference in position (in angles) the update of the servo position should take place (sending a command to the servo)
pl: **X / Y step** – co jaką różnicę w pozycji (w kątach) ma odbywać się aktualizacja pozycji serwa (wysłanie komendy do serwa)

source: **X / Y multiplier** - angle multiplier, allows you to multiply the angle by which the movement is made (the nominal value is multiplied by the multiplier)
pl: **X / Y multiplier** – mnożnik kątów, pozwala zwielokrotnić kąt o jaki dokonywany jest ruch (nominalna wartość jest mnożona przez mnożnik)

source: Video Filters
pl: Filtry obrazu wideo

source: From the menu level, you can enable filters for the video.
pl: Z poziomu menu włączyć można filtry dla obrazu.

source: Several predefined filters are available, such as digital simulation of night vision or thermal imaging.
pl: Dostępnych jest kilka zdefiniowanych filtrów takich jak cyfrowa symulacja noktowizji, czy termowizji.

source: Each of the filters can be enabled for both video **input** and video **output**.
pl: Każdy z filtrów można włączyć zarówno dla **wejścia** jak i dla **wyjścia** obrazowego.

source: Input filters are applied before the video enters the neural network (AI receives the filtered video already), output filters are applied only for the video already displayed on the output to the user. You can enable as many filters as you want at once.
pl: Filtry dla wejścia są aplikowane przed wejściem obrazu do sieci neuronowej (AI otrzymuje już przefiltrowany obraz), filtry wyjściowe są aplikowane jedynie dla wyświetlanego już na wyjściu użytkownikowi obrazu. Można włączyć dowolną ilość filtrów naraz.

source: An example of the effect after enabling **Nightvision** filter, which digitally enhances the video:
pl: Przykładowy efekt po włączeniu filtru **Noktowizja / Nightvision**,wzmacniającego cyfrowo obraz:

source: Configuration
pl: Konfiguracja

source: "config.ini" file
pl: Plik "config.ini"

source: When the application starts, the entire configuration is loaded from the **config.ini** file located in the user home dir directory. The file is copied from app directory to the user's home directory in the system at first launch and then is readed from there. By modifying this file (in your home dir), you can change the startup parameters of the application.
pl: Podczas uruchomienia aplikacji cała konfiguracja ładowana jest z pliku **config.ini** znajdującego się w katalogu użytkownika w systemie. Plik jest tam kopiowany podczas pierwszego uruchomienia aplikacji z katalogu głównego katalogu aplikacji. Modyfikując ten plik (w katalogu użytkownika) można zmienić parametry startowe aplikacji.

source: The file can be edited directly from the application - in the **Configuration > Edit startup config.ini** menu option.
pl: Plik można edytować bezpośrednio z poziomu aplikacji - w menu **Konfiguracja / Edytuj config.ini**.

source: The configuration file allows for full configuration of the whole, e.g. the language of the server application can be changed in the **config.ini** file using the **app.lang** parameter (2 languages are available: **en** and **pl**):
pl: Plik konfiguracyjny pozwala na pełną konfigurację całości, np. język aplikacji serwerowej można zmienić w pliku **config.ini** za pomocą parametru **app.lang** (dostępne są 2 języki: **pl** i **en**):

source: The localization texts are in the files in the **locale** directory in the directory with the application.
pl: Teksty lokalizacyjne znajdują się w plikach w katalogu **locale** w katalogu z aplikacją.

source: **Tip:** in case of an incorrect configuration, you can load back the default configuration file using the **Load defaults** and then save the changes **.** You can also copy the default file from the **assets/defaults/config.ini** directory and replace the modified **config.ini** file.
pl: Tip: w przypadku podania błędnej konfiguracji można załadować z powrotem domyślny plik z konfiguracją używając opcji Załaduj domyślny i następnie zapisać zmiany. Można również skopiować domyślny plik z katalogu ``assets/defaults/config.ini`` zastępując zmodyfikowany config.ini.

source: **A similar configuration for the web application is in the "config.js" file.**
pl: Analogiczna konfiguracja dla aplikacji webowej znajduje się w pliku **config.js**.

source: **A full description of all parameters in the configuration file can be found later in the documentation.**
pl: **Pełny opis wszystkich parametrów w pliku konfiguracyjnym znajduje się w dalszej części dokumentacji.**

source: "hosts.txt" file
pl: Plik "hosts.txt"

source: When the application starts, the list of clients is loaded from the **hosts.txt** file located in the user home directory. The file is copied from app directory to the user's home directory in the system at first launch and then is readed from there. By modifying this file (in your home dir), you can set your own list of clients list loaded by default in the application.
pl: Podczas uruchomienia aplikacji lista klientów ładowana jest z pliku **hosts.txt** znajdującego się w katalogu użytkownika w systemie. Plik jest tam kopiowany podczas pierwszego uruchomienia aplikacji z katalogu głównego katalogu aplikacji. Modyfikując ten plik (w katalogu użytkownika) można ustalić własną listę domyślnie ładowanej do aplikacji listy klientów.

source: The file can be edited directly from the application, in the **Configuration > Edit hosts.txt** menu option.
pl: Plik można edytować bezpośrednio z poziomu aplikacji, w menu **Konfiguracja / Edytuj hosts.txt**.

source: "streams.txt" file
pl: Plik "streams.txt"

source: When the application starts, the list of hosts with streams is loaded from the **streams.txt** file located in the user home directory. The file is copied from app directory to the user's home directory in the system at first launch and then is readed from there. By modifying this file (in your home dir), you can set your own list of hosts list loaded by default in the application.
pl: Podczas uruchomienia aplikacji lista hostów ze streamem ładowana jest z pliku **streams.txt** znajdującego się w katalogu użytkownika w systemie. Plik jest tam kopiowany podczas pierwszego uruchomienia aplikacji z katalogu głównego katalogu aplikacji. Modyfikując ten plik (w katalogu użytkownika) można ustalić własną listę domyślnie ładowanej do aplikacji listy hostów w zakładce Stream.

source: The file can be edited directly from the application, in the **Configuration > Edit streams.txt** menu option.
pl: Plik można edytować bezpośrednio z poziomu aplikacji, w menu **Konfiguracja / Edytuj streams.txt**.

source: Client - client application (Python, Raspberry, PC, Arduino)
pl: Klient - aplikacja kliencka (Python, Raspberry, PC, Arduino)

source: The client application is designed to receive commands from the server application and physically communicate with the camera and servos. It allows for remote control using a server application connected to it. It is located in the **Client** directory . A Python version is prepared for any system such as **Windows**, **Linux** or **Rasbian** in **Raspberry**, as well as a code to be uploaded to **Arduino**. The application can be run on any device equipped with a Python interpreter.
pl: Aplikacja kliencka przeznaczona jest do odbierania komend z aplikacji serwerowej oraz fizycznego komunikowania się z kamerą i serwomechanizmami. Pozwala na zdalne sterowanie za pomocą połączonej do niej aplikacji serwerowej. Znajduje się w katalogu **Client**. Przygotowana jest wersja w Pythonie, dla dowolnego systemu jak **Windows**, **Linux**, czy **Rasbian** w **Raspberry**, a także kod do wgrania na **Arduino**. Aplikacja jest do uruchomienia na dowolnym urządzeniu wyposażonym w interpreter Pythona.

source: It can be run on any PC, as well as a Raspberry minicomputer. After running on the computer, it starts listening for connections from the server and, if the connection is established, it starts sending the image from the connected camera via the network/WiFi to the server application. At this time, the server application can transfer commands to control the mechanism to the client application, which the client application sends further to the hardware (Arduino or directly from the Raspberry, depending on how the whole and selected components are connected).
pl: Może zostać uruchomiona na dowolnym komputerze PC, a także minikomputerze typu Raspberry. Po uruchomieniu na komputerze rozpoczyna nasłuchiwanie połączeń z serwera i w przypadku nawiązania połączenia rozpoczyna przesyłane obrazu z podłączonej kamery po sieci/WiFi do aplikacji serwerowej. Aplikacja serwerowa w tym czasie może przekazywać do aplikacji klienckiej komendy sterujące mechanizmem, które to komendy aplikacja kliencka wysyła dalej do sprzętu (Arduino, lub bezpośrednio z Raspberry, zależnie od sposobu podłączenia całości i wybranych komponentów).

source: Client installation on Raspberry Pi (Python >= 3.9 required):
pl: Instalacja klienta na Raspberry Pi (wymagany Python >= 3.9):

source: Client installation on PC (Python >= 3.9 required):
pl: Instalacja klienta na PC (wymagany Python >= 3.9):

source: **Note:** Before installing from "requirements.txt", you may need to install the packages first:
pl: **Uwaga:** przed instalacją z „requirements.txt” może być konieczne uprzednie zainstalowanie paczek:

source: **Note:** the installation of OpenCV on the Raspberry may take some time (the system may be unresponsive for a long time).
pl: **Uwaga:** instalacja OpenCV na Raspberry może zająć trochę czasu (system może w tym czasie przez długi czas nie odpowiadać).

source: The application can be launched in one of two modes: **standard (desktop)** and **web**:
pl: Aplikacja może zostać uruchomiona w jednym z dwóch trybów: **standardowym (desktopowym)** oraz **webowym:**:

source: In standard (desktop) mode, it enables connection to a desktop server application, and in web mode, it allows connection to a remote web application (via a browser). Both of these modes in the current version cannot work simultaneously.
pl: W standardowym trybie umożliwia połączenie się z serwerową aplikacją desktopową, a w trybie webowym pozwala na połączenie zdalnej aplikacji webowej (przez przeglądarkę). Oba te tryby w obecnej wersji nie mogą pracować jednocześnie.

source: The application can be launched with arguments, the startup parameters can be modified in the **config.ini** file located in the directory with the application.
pl: Aplikacja może zostać uruchomiona z argumentami, parametry startowe można zmodyfikować w pliku **config.ini** znajdującym się w katalogu z aplikacją.

source: The type of connected hardware (Arduino or Raspberry) can be defined in the **config.ini** file using the **client.device** option:
pl: Rodzaj podłączonego sprzętu (Arduino lub Raspberry) można zdefiniować w pliku **config.ini** za pomocą opcji **client.device**:

source: or
pl: lub

source: The device type can also be selected when starting the application, using the ``--device`` parameter e.g.:
pl: Typ urządzenia można również wybrać podczas uruchamiania aplikacji, za pomocą parametru ``--device``, np.:

source: **Note**: if the client application is running on a Raspberry, but an Arduino is additionally connected to the Raspberry to control the mechanisms, set device = **arduino** (and not **raspberry**) here. We set the **raspberry** device only when we want to control it directly using raspberry GPIO pins.
pl: **Uwaga**: jeśli aplikacja kliencka uruchomiona jest na Raspberry, ale do Raspberry w celu sterowania mechanizmami podłączone jest dodatkowo Arduino to należy tutaj ustawić urządzenie = **arduino** (a nie **raspberry**). Urządzenie **raspberry** ustawiamy jedynie, gdy chcemy sterować bezpośrednio za pomocą pinów GPIO raspberry.

source: It is possible to specify here raspberry as a device also in the case of control using Arduino, but in this case, in its configuration, specify the serial port for the connected Arduino and select **serial instead of gpio as the output:**
pl: Można ew. podać tutaj raspberry jako urządzenie również w przypadku sterowania za pomocą Arduino, ale w przypadku takim należy w jego konfiguracji podać port szeregowy dla podłączonego Arduino oraz jako wyjście zamiast **gpio** wybrać **serial:**

source: **Tip:** On Linux/Raspberry systems, Arduino will usually be available on ports: **/dev/ttyUSB0** *(nano)* or **/dev/ttyACM0** *(uno)*
pl: **Tip:** Na systemach linuxowych/Raspberry Arduino zazwyczaj dostępne będzie na portach: ``/dev/ttyUSB0`` *(nano) lub* ``/dev/ttyACM0`` *(uno)*

source: **USB connection**
pl: **Podłączenie za pomocą USB**

source: If the Raspberry will be connected via the USB port to the control computer (server), and not via WiFi, then in the configuration, enter the input as serial instead of network and specify the serial port used for transmission from the computer:
pl: Jeśli Raspberry będzie podłączone za pomocą portu USB do komputera sterującego (serwera), a nie poprzez WiFi, to należy w konfiguracji podać wejście jako serial, zamiast network oraz określić port szeregowy używany do transmisji z komputera:

source: For greater reliability, the application should be run in conjunction with supervisory software such as **Supervisor**, which monitors the status of running applications on an ongoing basis and can, for example, restart them if necessary.
pl: Dla większej niezawodności, aplikacja powinna być uruchomiona w połączeniu z oprogramowaniem nadzorującym typu **Supervisor**, które monitoruje na bieżąco stan uruchominych aplikacji i potrafi je np. w razie potrzeby zrestartować.

source: You can run the client application with the following arguments:
pl: Aplikację kliencką można uruchomić z następującymi argumentami:

source: **Tip: -short option --option - description (default)**
pl: **Składnia:** -opcja skrócona --opcja - opis (wartość domyślna)

source: **-c --camera** - camera index/number (0)
pl: **-c --camera** - indeks/numer kamery (0)

source: **-d --device** – type of connected device (**raspberry** or **arduino**)
pl: **-d --device** – rodzaj podłączonego urządzenia (**raspberry** lub **arduino**)

source: **-p --pi** - on/off using Raspberry Pi camera (0)
pl: **-p --pi** - wł/wył. używanie kamery Raspberry Pi (0)

source: **-x --width** - width of the captured image /px/ (1280)
pl: **-x --width** - szerokość przechwytywanego obrazu /px/ (1280)

source: **-y --height** - height of captured image /px/ (720)
pl: **-y --height** - wysokość przechwytywanego obrazu /px/ (720)

source: **-i --ip** - client IP address (0.0.0.0)
pl: **-i --ip** - adres IP klienta (0.0.0.0)

source: **-s --server-ip** - Default server IP
pl: **-s --server-ip** - IP domyślnego serwera

source: **-w --web** - on/off image streaming to browser mode (MJPEG) (0)
pl: **-w --web** - wł/wył. streaming obrazu do trybu przeglądarkowego (MJPEG) (0)

source: **-v --verbose** - on/off displaying the status in the terminal (0)
pl: **-v --verbose** - wł/wył. wyświetlanie statusu w terminalu (0)

source: **-n --hidden** - on/off silent mode, without any messages, statuses and etc. in terminal (0)
pl: **-n --hidden** - wł/wył. tryb cichy, bez żadnych komunikatów, statusów i etc. w erminalu (0)

source: **-u --status** - on/off check device status and send to server (0)
pl: **-u --status** - wł/wył. sprawdzanie statusu urządzenia i wysyłanie do serwera (0)

source: **-e --debug** - on/off debug mode (0)
pl: **-e --debug** - wł/wył. Tryb debug (0)

source: If no arguments are given during startup, the default values read from the config.ini configuration file are used.
pl: Jeśli podczas uruchamiania nie podane są żadne argumenty używane są wartości domyślne odczytane z pliku konfiguracyjnego config.ini.

source: In the case of the client for Linux, bash scripts are prepared to run the application, which make it easier to run, they are located in the ``./bin`` directory:
pl: W przypadku klienta dla systemu Linux do uruchamiania aplikacji przygotowane są skrypty bash-a, które ułatwiają uruchamianie, znajdują się w katalogu ./bin:

source: **start** – a script that starts the client in **remote mode** (to operate with desktop application), in silent mode
pl: **start** – skrypt uruchamiający klienta dla **trybu remote** (aplikacji desktopowej) w opcji cichej

source: **start-web** – a script that starts the client in **web mode** (mode that allows you to connect via webbrowser), in silent mode
pl: **start-web** – skrypt uruchamiający klienta dla **trybu webowego** (do podłączenia przez przeglądarkę), w opcji cichej

source: It is recommended to run the client in a virtual environment (e.g. using python **venv**):
pl: Zalecane jest uruchamianie klienta w wirtualnym środowisku (np. za pomocą pythonowego **venv**):

source: Scripts from **./bin** directory run the client in a virtual environment. After modifying the paths, they can be used as launch shortcuts (after creating the **venv** environment as above). In the package, in the "examples/supervisor" directory there are also sample configuration files for the supervisor, which can be placed in your configuration directory: **/etc/supervisor/conf.d**.
pl: Skrypty z katalogu **./bin** uruchamiają klienta w środowisku wirtualnym, po modyfikacji ścieżek można ich użyć jako skrótów uruchamiających (po uprzednim utworzeniu środowiska **venv** jak wyżej). W pakiecie, w katalogu „examples/supervisor” są ponadto zawarte przykładowe pliki konfiguracyjne dla supervisora, które należy jedynie umieścić w swoim katalogu z konfiguracją: **/etc/supervisor/conf.d**\ *.*.

source: Sample supervisor configuration file:
pl: Przykładowy pliki konfiguracyjny dla supervisora:

source: After adding the configuration file, give it the appropriate permissions and reload the configuration:
pl: Po dodaniu pliku z konfiguracją należy nadać mu odpowiednie uprawnienia i przeładować konfigurację:

source: Where **pi** is an example username. It is also worth activating the supervisor service so that it is started automatically when the system starts:
pl: gdzie **pi** to przykładowa nazwa usera. Warto również aktywować serwis supervisora, aby był uruchamiany automatycznie wraz ze startem systemu:
