Repository: szczyglis-dev/py-gpt
Catalog: docs/source/locale/*/LC_MESSAGES/software.po
Languages: pl

source: Software
pl: Oprogramowanie

source: General architecture
pl: Ogólna architektura

source: The software consists of several cooperating components - they are divided into individual directories:
pl: Oprogramowanie składa się z kilku współpracujących ze sobą komponentów - są one podzielone na poszczególne katalogi:

source: **App/Server** - server (management) application, run on a managing/calculating machine, **PC: Windows 10 or Linux**
pl: **App/Server** - aplikacja serwerowa (zarządzająca), uruchamiana na maszynie zarządzającej/obliczającej, **PC: Windows 10 lub Linux**

source: **Client** - client applications (physically controlling the hardware), run on a machine physically connected to the servo and camera: **Raspberry, Arduino or PC: Windows 10 or Linux**
pl: **Client** - aplikacje klienckie (fizycznie sterujące sprzętem), uruchamiane na maszynie fizycznie połączonej z serwomechanizmem i kamerą: **Raspberry, Arduino, PC (Windows, Linux)**

source: **Web** - web application, i.e. a separate version of the application, which can be run under a web browser, allowing you to control servos using a browser on a computer or smartphone.
pl: **Web** - webaplikacja, czyli oddzielna wersja aplikacji, możliwa do uruchomienia pod przeglądarką WWW, pozwalająca na sterowanie serwomechanizmami za pomocą przeglądarki na komputerze lub smartfonie.

source: The server application and the web application can operate simultaneously as a server + client (i.e. it is possible to connect the hardware directly to them via a USB port - then a separate client application is not required and the whole thing can be controlled locally directly from the server application).
pl: Aplikacja serwerowa oraz webaplikacja mogą działać jednocześnie jako serwer + klient (tj. istnieje możliwość podłączenia hardware'u bezpośrednio pod nie, za pomocą portu USB - nie jest wtedy wymagana oddzielna aplikacja kliencka i całością można sterować lokalnie bezpośrednio z poziomu aplikacji serwerowej).

source: In the case of web applications, it is required to run a web server. A production webserver, e.g. **Nginx** is recommended due to greater efficiency and reliability, but it is also possible to run the whole thing using a simple webserver for Python built-in **(Flask)** framework, included in the package.
pl: W przypadku webaplikacji wymagane jest uruchomienie webserwera. Zalecany jest produkcyjny webserwer, np. **Nginx** ze względu na większą wydajność i bezawaryjność, ale możliwe jest również uruchomienie całości za pomocą załączonego w pakiecie prostego webserwera dla Pythona **(Flask)**.

source: Server applications have been prepared for two operating systems: **Windows 10** and **Linux** - they are portable, i.e. they do not require any installation in the system, just unpack the archive - all libraries required for work are contained locally in their directories. The desktop application code was written in Python v3.10, PyInstaller was used to prepare binary/executable versions for Windows and Linux.
pl: Aplikacja serwerowa oraz webaplikacja mogą działać jednocześnie jako serwer + klient (tj. istnieje możliwość podłączenia hardware'u bezpośrednio pod nie, za pomocą portu USB - nie jest wtedy wymagana oddzielna aplikacja kliencka i całością można sterować lokalnie bezpośrednio z poziomu aplikacji serwerowej).

source: App/Server - server application (Windows, Linux)
pl: App/Serwer - aplikacja serwerowa (Windows, Linux)

source: The desktop server application that manages the whole thing is designed to run on the user's computer, which will control the operation of the mechanism. It is located in the **App (Server)** directory and is available for Windows and Linux.
pl: Desktopowa aplikacja serwerowa, zarządzająca całością przeznaczona jest do uruchomienia na komputerze użytkownika, który będzie sterował pracą mechanizmu. Znajduje się w katalogu „App (Server)” i jest dostępna dla systemów Windows i Linux.

source: In the local operating mode, the Application allows for connection of all accessories (USB camera and microcontroller in the form of e.g. Arduino or Raspberry to control servos) directly to the computer on which the application is running. In the second mode - remote operation, it allows you to manage the equipment connected to the remote device (the so-called client, e.g. a Raspberry minicomputer with a client application running and a CSI camera and a controller for servos connected), communication then takes place via the network/WiFi.
pl: W lokalnym trybie pracy aplikacja umożliwia lokalne podłączenie całego osprzętu (kamera USB oraz mikrokontroler w postaci np. Arduino, lub Raspberry do sterowania serwomechanizmami) bezpośrednio do komputera, na którym uruchomiona jest aplikacja. W drugim trybie - pracy zdalnej, umożliwia natomiast zarządzanie sprzętem podłączonym do urządzenia zdalnego (tzw. klienta, np. minikomputera Raspberry z uruchomioną aplikacją kliencką i z podłączoną kamerą CSI oraz sterownikiem dla serwomechanizmów), komunikacja odbywa się wtedy poprzez sieć/WiFi.

source: Camera and servo connection options
pl: Opcje połączenia z kamerą i serwomechanizmem

source: Local Mode - CAM (USB)
pl: Tryb lokalny - KAM (USB)

source: In this mode, both the camera and the microcontroller (e.g. Arduino) or Raspberry computer are connected directly via USB ports to the same machine on which the server application is running.
pl: W tym trybie zarówno kamera jak i mikrokontroler (np. Arduino), lub komputer typu Raspberry podłączany jest bezpośrednio poprzez porty USB do tej samej maszyny, na której uruchomiona jest aplikacja serwerowa.

source: As the operating mode, select the **CAM (USB)** in order to get an video capture from the camera connected directly to the USB port. In the **Servo** menu select the **Local > (serial port)** option from the list, where **(serial port)** is the name under which it is available, e.g. Arduino with servos connected. The port name may vary depending on the operating system and devices already connected, e.g. **COM5** on Windows and **/dev/ttyACM0** or **/dev/ttyUSB0** on Linux.
pl: Jako tryb pracy należy wybrać w aplikacji **KAM (USB)**, aby uzyskać obraz z kamery podłączonej bezpośrednio do portu USB oraz w menu **Serwo** należy wybrać z listy opcję **Lokalne >(port szeregowy)**, gdzie **(port szeregowy)** to nazwa pod jaką dostępne jest np. Arduino z podłączonymi serwomechanizmami. Nazwa portu może się różnić zależnie od systemu operacyjnego i podłączonych już urządzeń, np. na Windowsach może to być **COM5**, a na Linuxach ``/dev/ttyACM0`` lub ``/dev/ttyUSB0``.

source: In this operating mode, the server application here behaves simultaneously as a client and server, working with locally connected hardware.
pl: W tym trybie pracy aplikacja serwerowa zachowuje się tutaj jednocześnie jako klient i serwer, pracując z lokalnie podłączonym sprzętem.

source: Remote Mode - CAM (IP)
pl: Tryb zdalny - KAM (IP)

source: In the **CAM (IP)** remote operation mode, the server connects to the remote client application (running e.g. on a Raspberry minicomputer or any other computer connected via the network/WiFi) and remotely receives only the video capture from the camera from the client application, and then performs all calculations and controlling the whole by remotely sending control commands to the client (who then sends them further to the servo).
pl: W trybie pracy zdalnej **KAM (IP)** serwer łączy się ze zdalną aplikacją kliencką (uruchomioną np. na podłączonym przez sieć/WiFi minikomputerze Raspberry lub innym dowolnym komputerze) i pobiera zdalnie z aplikacji klienckiej jedynie obraz z kamery, a następnie zajmuje się wszystkimi obliczeniami i sterowaniem całością wysyłając zdalnie komendy sterujące do klienta (który następnie przesyła je dalej do serwomechanizmu).

source: To connect to a remote client application, select **CAM (IP)** mode, and then enter the host name or IP address under which the client machine is available in the network. Then select the **Connect / activate** option from the context menu available with the right mouse button (PPM) on the list of connected clients located on the left side of the main program window in the **IP** tab.
pl: Aby połączyć się ze zdalną aplikacją kliencką należy wybrać tryb **KAM (IP)**, a następnie podać nazwę hosta lub adres IP pod jakim w sieci dostępna jest maszyna klienta. Następnie należy wybrać opcję **Połącz / aktywuj** z menu kontekstowego dostępnego pod prawym przyciskiem myszki (PPM) na liście podłączonych klientów znajdującej się po lewej stronie głównego okna programu w zakładce **IP**.

source: **NOTE:** the connection to the client can sometimes be lost for various reasons, e.g. due to a physical power failure of the remote machine. The application then automatically attempts to resume such connections in order to restore communication, but if this fails, then to restore the connection manually, you must reconnect to the client (again selecting the **Connect / activate** option). In the context menu on the list of clients, there are also options such as **Restart**, which restarts the connection on the client's machine, and the **Destroy** option, which shuts down the client application remotely and restarts it if a Supervisor type application is installed on the client. This may be useful, for example, in the event of any problems with the operation of the client application on the client's computer.
pl: **UWAGA:** połączenie z klientem czasami z różnych powodów może zostać utracone, np. w wyniku fizycznego wyłączenia zasilania zdalnej maszyny. Podejmowane są wtedy przez aplikację automatyczne próby wznawiania takich połączeń w celu przywrócenia komunikacji, jednakże gdyby się to nie udało to aby przywrócić wtedy połączenie ręcznie, należy ponownie połączyć się z klientem (ponownie wybierając opcję **Połącz / aktywuj**). W menu kontekstowym na liście klientów dostępne są również opcje takie jak **Restart**, która restartuje połączenie na maszynie klienta oraz opcja **Wyłącz zdalnie**, która wyłącza zdalnie aplikację kliencką i uruchamia ją ponownie jeśli na kliencie zainstalowana jest aplikacja typu Supervisor. Może być to przydatne np. w przypadku wystąpienia ew. problemów z działaniem aplikacji klienckiej na komputerze klienta.

source: When working with a remote client, only one client is active on the screen at a time, however video data is received all the time from all connected clients simultaneously. This can be used by selecting the **Preview** tab , which will show in one window a summary image from all simultaneously connected clients.
pl: Podczas pracy ze zdalnym klientem w danej chwili aktywny jest na ekranie zawsze tylko jeden klient, jednakże dane wideo odbierane są przez cały czas jednocześnie ze wszystkich podłączonych klientów. Można to wykorzystać wybierając zakładkę **Podgląd**, która pokaże w jednym oknie zbiorczy obraz ze wszystkich podłączonych jednocześnie klientów.

source: The list of clients, which will be loaded automatically into the application at the time of its launch, can be prepared manually by editing the **hosts.txt** file located in the directory with the server application and copied to the user's directory during the first launch. In this file, the names of client computers should be given, each in a separate line and according to the scheme **host [space] IP [space] description** , as shown below:
pl: Listę klientów, która będzie ładowana automatycznie do aplikacji w momencie jej uruchomienia można przygotować ręcznie edytując plik **hosts.txt** znajdujący się w katalogu z aplikacją serwerową i kopiowany do katalogu użytkownika podczas pierwszego uruchomienia. W pliku tym podać należy nazwy komputerów klientów, każdy w oddzielnej linijce i wg schematu ``host [spacja] IP [spacja] opis``, tak jak to zostało pokazane poniżej:

source: Sample **hosts.txt** file:
pl: Przykładowy plik **hosts.txt**:

source: The hosts (clients) from this file are loaded into the program automatically when it is launched.
pl: Hosty (klienci) z tego pliku są ładowane do programu automatycznie podczas jego uruchomienia.

source: Thanks to this, you can prepare a list of your own devices, which will be loaded automatically and will significantly speed up clients management. The hosts file can also be edited directly from the server application: **Menu > Configuration > Edit hosts.txt**.
pl: Można dzięki temu przygotować sobie listę własnych urządzeń, która będzie ładowana automatycznie i znacznie przyspieszy zarządzanie klientami. Plik z hostami edytować można również bezpośrednio z poziomu aplikacji serwerowej: **Menu > Konfiguracja > Edytuj hosts.txt**.

source: Remote mode - STREAM (webserver, HTTP / MJPEG)
pl: Tryb zdalny – STREAM (webserwer, HTTP / MJPEG)

source: **STREAM** remote mode the server connects to the webserver run by the remote client application (running e.g. on a Raspberry minicomputer or any other computer connected via the network/WiFi) and downloads only the camera image from the webserver, and then takes care of all calculations and control of the whole by sending remote control commands to client via HTTP (the client then forwards the commands to the servo).
pl: W trybie pracy zdalnej **STREAM** serwer łączy się z webserwerem uchomionym przez zdalną aplikację kliencką (uruchomioną np. na podłączonym przez sieć/WiFi minikomputerze Raspberry lub innym dowolnym komputerze) i pobiera z webserwera jedynie obraz z kamery, a następnie zajmuje się wszystkimi obliczeniami i sterowaniem całością wysyłając zdalnie komendy sterujące do klienta za pomocą protokołu HTTP (klient następnie przesyła komendy dalej do serwomechanizmu).

source: To connect to a remote web server, select the **STREAM** mode, and then enter the host name or IP address and port under which the client machine is available in the network. Then select the **Connect / activate option** from the context menu available with the right mouse button (PPM) on the list of addresses with stream located on the left side of the main program window in the **STREAM** tab.
pl: Aby połączyć się ze zdalnym webserwerem należy wybrać tryb **STREAM**, a następnie podać nazwę hosta lub adres IP i port pod jakim w sieci dostępna jest maszyna klienta. Następnie należy wybrać opcję **Połącz / aktywuj** z menu kontekstowego dostępnego pod prawym przyciskiem myszki (PPM) na liście adresów ze streamem znajdującej się po lewej stronie głównego okna programu w zakładce **STREAM**.

source: When working with a remote web server, only one client is active on the screen at a time.
pl: Podczas pracy ze zdalnym webserwerem w danej chwili aktywny jest na ekranie zawsze tylko jeden klient.

source: **streams.txt** is a file located in the directory with the server application and copied to the user's directory during the first launch. In this file, the names of client computers should be given, each in a separate line and according to the scheme **protocol://host:port [space] description**, as shown below:
pl: Listę hostów z udostępnianym streamem, która będzie ładowana automatycznie do aplikacji w momencie jej uruchomienia można przygotować ręcznie edytując plik **streams.txt** znajdujący się w katalogu z aplikacją serwerową i kopiowany do katalogu użytkownika podczas pierwszego uruchomienia. W pliku tym podać należy nazwy komputerów klientów, każdy w oddzielnej linijce i wg schematu ``protokół://host:port [spacja] opis``, tak jak to zostało pokazane poniżej:

source: Sample **streams.txt** file:
pl: Przykładowy plik **streams.txt**:

source: Stream addresses from this file are loaded into the program automatically when it is launched.
pl: Adresy do streamu z tego pliku są ładowane do programu automatycznie podczas jego uruchomienia.

source: If a security token is used for the connection, it should be added to the entry after the **pass=** prefix.
pl: Jeśli do połączenia używany jest token zabezpieczający to należy go dodać do wpisu po prefixie **pass=**.

source: Example:
pl: Przykład:

source: Thanks to this, you can prepare a list of your own devices, which will be loaded automatically and will significantly speed up host management. The streams file can also be edited directly from the server application: **Menu > Configuration > Edit streams.txt**.
pl: Można dzięki temu przygotować sobie listę własnych urządzeń, która będzie ładowana automatycznie i znacznie przyspieszy zarządzanie hostami. Plik z hostami edytować można również bezpośrednio z poziomu aplikacji serwerowej: **Menu > Konfiguracja > Edytuj streams.txt**.

source: **To be able to connect via the webserver, the client must be started with the ``web=1`` option:**
pl: **Aby była możliwość połączenia się poprzez webserwer klient musi być uruchomiony z opcją** ``web=1``

source: **Note:** the web connection is slower than the IP connection (via sockets) - there may be delays in video transmission when simultaneously sending control commands and during the entire working time, the video may be delayed by approx. 500ms in relation to the video sent using the socket method.
pl: **Uwaga:** połączenie webowe jest wolniejsze, niż połączenie IP (przez sockety) – mogą powstawać opóźnienia w przesyłaniu obrazu podczas jednoczesnego wysyłania komend sterujących oraz podczas całego czasu pracy obraz może być opóźniony o ok. 500ms w stosunku do obrazu przesyłanego metodą socketową.

source: Modes of work with different video sources
pl: Tryby pracy z różnymi źródłami obrazu

source: The server application can work with 4 different video sources:
pl: Aplikacja serwerowa może pracować z 4 różnymi źródłami obrazu:

source: **CAM (USB)** - control of a camera connected locally to the USB port, and servos locally connected via the USB port, e.g. using Arduino
pl: **KAM (USB)** - sterowanie lokalnie podłączoną kamerą do portu USB, oraz serwomechanizmami lokalnie podłączonymi przez port USB np. za pomocą Arduino

source: **CAM (IP)** - remote control via sockets of the camera and servomotors connected via the network, e.g. to Raspberry Pi or to another remote computer
pl: **KAM (IP)** - zdalne sterowanie za pomocą socketów kamerą i serwomotorami podłączonymi przez sieć np. do Raspberry Pi lub do innego zdalnego komputera

source: **VIDEO** - the ability to run a video file instead of the video from the camera
pl: **VIDEO** - możliwość uruchomienia pliku video zamiast obrazu z kamery

source: **STREAM** - the ability to receive a stream (IPTV) or connect and control servers via a webserver built into the client
pl: **STREAM** - możliwość odbioru streamu (IPTV) lub połączenia i sterowania serwami poprzez webserwer wbudowany w klienta

source: **CAM (USB)**
pl: **KAM (USB)**

source: In this mode, connect the camera to the USB port of the computer on which the server application is running. The servos should be connected to the Arduino or Raspberry, and the Arduino or Raspberry should be connected to the same computer via the USB port and then select this port in the application in the **Servo > Local > (port name)** menu.
pl: W trybie tym należy podłączyć kamerę do portu USB komputera na jakim uruchomiona jest aplikacja serwerowa. Serwomechanizmy należy podłączyć do Arduino lub Raspberry, a Arduino lub Raspberry podłączyć do tego samego komputera za pomocą portu USB i następnie wybrać ten port w aplikacji w menu **Serwo / Lokalne / (nazwa portu)**.

source: **Note:** the port must be available to the application, using it at the same time by another application will block its use here. If the system lacks drivers, e.g. for Arduino, you must first install the appropriate drivers provided by the manufacturer.
pl: Uwaga: port musi być dostępny dla aplikacji, używanie go w tym samym czasie przez inną aplikację zablokuje możliwość jego użycia tutaj. Jeśli w systemie brakuje sterowników np. dla Arduino, należy najpierw zainstalować odpowiednie sterowniki udostępniane przez producenta.

source: **CAM (IP)**
pl: **KAM (IP)**

source: In this mode, the server application connects remotely (via the network / WiFi) with an external computer (client) to which the camera and servos are connected. Communication then takes place using the TCP protocol, the image from the camera is then sent remotely from the client to the server, and control commands are sent from the server to the client via a network socket (socket).
pl: W trybie tym aplikacja serwerowa łączy się zdalnie (poprzez sieć / WiFi) z zewn. komputerem (klientem) do którego podłączona jest kamera i serwomechanizmy. Komunikacja odbywa się wtedy za pomocą protokołu TCP, obraz z kamery przesyłany jest wtedy zdalnie z klienta do serwera, a komendy sterujące przesyłane są z serwera do klienta za pomocą gniazdka sieciowego (socket-a).

source: The role of the client to which the camera and servos can be remotely connected can be any computer, e.g. a regular desktop, mini-desktop or Raspberry. The only requirement is that it should be available via the network/WiFi and that it should provide physical communication (control) with servos, e.g. using an Arduino connected to the USB port, or directly through its GPIO PWM pins (if the customer is e.g. Raspberry).
pl: Rolę klienta, do którego zdalnie podłączyć można kamerę i serwomechanizmy pełnić może dowolny komputer, np. zwykły desktop, mini-desktop lub Raspberry. Jedynym wymogiem jest to, aby był dostępny poprzez sieć/WiFi oraz aby zapewniał fizyczną komunikację (sterowanie) z serwomechanizmami, np. za pomocą podłączonego do portu USB Arduino, lub bezpośrednio poprzez swoje wyprowadzenia GPIO PWM (jeśli klientem jest np. Raspberry).

source: **Connecting to clients (IP)**
pl: **Łączenie z klientami (IP)**

source: To connect to a remote client, the client application (from the **Client directory**) must be running on it.
pl: Aby połączyć się ze zdalnym klientem, musi być na nim uruchomiona aplikacja kliencka (z katalogu **Client**).

source: Then, using the server application, enter the **client's IP address** under which it is available in the network in the address bar at the top of the window:
pl: Następnie za pomocą aplikacji serwerowej należy w pasku adresu znajdującym się na górze okna podać **nazwę hosta klienta**, lub **jego adres IP** pod jakim dostępny jest w sieci:

source: After entering the address and clicking the **Connect** button, an attempt will be made to connect to the client, and the client should appear on the list of clients on the left side of the program window:
pl: Po wpisaniu adresu i kliknięciu na przycisk **Połącz** nastąpi próba połączenia się z klientem, a klient powinien pojawić się na liście klientów po lewej stronie okna programu:

source: In case of connection problems, make sure that the client application is running on the client machine and that the host/IP addresses are correct. In case of problems, you can also use the **Restart** or **Destroy** options available from the context menu (RMB) in the list of clients.
pl: W przypadku problemów z połączeniem należy upewnić się, czy na maszynie klienta na pewno działa aplikacja kliencka oraz czy podane adresy hosta/IP są poprawne. W przypadku problemów można również użyć opcji **Restart** lub **Wyłącz zdalnie** dostępnych z menu kontekstowego (PPM) na liście klientów.

source: The list of clients loaded when starting the server application can be edited in the **hosts.txt** file located in the directory with the server application.
pl: Listę klientów ładowaną podczas startu aplikacji serwerowej edytować można w pliku **hosts.txt** znajdującym się w katalogu z aplikacją serwerową.
