Repository: szczyglis-dev/py-gpt
Catalog: docs/source/locale/*/LC_MESSAGES/software.po
Languages: pl

source: At a given moment, one client can be managed from the level of the server application, however, the connection is maintained with all connected clients, therefore, using the **Preview** tab, you can view the current preview from all simultaneously connected clients and e.g. switch to the appropriate client using the list of clients by selecting the option **Connect / Activate**.
pl: W danym momencie z poziomu aplikacji serwerowej zarządzać można jednym klientem, jednakże połączenie utrzymywane jest ze wszystkimi podłączonymi klientami, dlatego też za pomocą zakładki **Podgląd** można podejrzeć sobie aktualny podgląd ze wszystkich podłączonych jednocześnie klientów i np. przełączyć na odpowiedniego klienta za pomocą listy klientów wybierając opcję **Połącz / aktywuj**.

source: **Tip:** On the client's computer, along with the client application, software for managing processes in the system should also be installed, e.g. Supervisor, which can automatically restart the finished application in the event of problems. The client application should also be loaded into memory with the system startup (autostart), if it is running on, for example, a Raspberry.
pl: Tip: na komputerze klienta razem z aplikacją kliencką powinno być również zainstalowane oprogramowanie do zarządzania procesami w systemie, np. Supervisor, który w momencie problemów potrafi automatycznie zrestartować zakończoną aplikację. Aplikacja kliencka powinna być też ładowana do pamięci wraz ze startem systemu (autostart), jeśli jest uruchomiona na np. Raspberry.

source: The Supervisor application can be downloaded from the manufacturer's website: http://supervisord.org/
pl: Aplikację Supervisor można pobrać ze strony producenta: http://supervisord.org/

source: In this mode, you can load any video file (e.g. mp4) from the disk or URL, and then run the tracking mode on it. The mode can be useful, for example, for testing purposes, to test the behavior on video material.
pl: W trybie tym załadować można zdalny stream z adresu URL, np. z IPTV, podając adres do pliku m3u8. Umożliwia to podłączenie obrazu z zewnętrznego streamu.

source: In this mode, you can load a remote stream from a URL, e.g. from IPTV, by specifying the address to the m3u8 file.
pl: W trybie tym załadować można zdalny stream z adresu URL, np. z IPTV, podając adres do pliku m3u8.

source: This allows you to connect an image from an external stream.
pl: Umożliwia to podłączenie obrazu z zewnętrznego streamu.

source: In this mode, you can also connect to a client working in **web** mode (with a running webserver). Such a connection can be more stable than a socket / IP connection (the webserver is running all the time, there is no need to establish a permanent connection between sockets), but the image can be sent with a greater delay. Support for the stream mode is similar to the **CAM (IP)** mode, with the difference that the connection goes through the web server built into the client. Using this mode, you can remotely control the server - commands are sent to the webserver and interpreted by the webserver.
pl: Tym trybem można również połączyć się z klientem pracującym w trybie **web** (z uruchomionym webserwerem). Takie połączenie może być bardziej stabilne, niż połączenie po socketach / IP (webserwer jest uruchomiony cały czas, nie trzeba nawiązywać stałego połączenia między socketami), ale obraz może być przesyłany z większym opóźnieniem. Obsługa trybu stream jest podobna do trybu **KAM(IP)**, z tą różnicą że połączenie przechodzi przez webserwer wbudowany w klienta. Za pomocą tego trybu można sterować zdalnie serwem – komendy są przesyłane do webserwera i interpretowane przez webserwer.

source: Control modes
pl: Tryby sterowania

source: The control of the whole is divided into 2 main modes: manual and automatic.
pl: Sterowanie całością dzieli się na 2 główne tryby: manualny i automatyczny.

source: In the left part of the window there are tabs for selecting the appropriate mode and additional tools.
pl: W lewej częsci okna znajdują się zakładki służące do wyboru odpowiedniego trybu oraz narzędzia dodatkowe.

source: **Tabs description:**
pl: **Opis poszczególnych zakładek:**

source: **Manual** - allows you to remotely control the mechanism using buttons and mouse, zoom, and manually turn on/off the action
pl: **Ręczne / Manual** - pozwala na zdalne sterowanie mechanizmem za pomocą przycisków i myszki, zoom, oraz manualne włączanie/wyłączanie akcji

source: **Auto (AI)** - allows you to automatically control the mechanism using built-in artificial intelligence (AI) models
pl: **Auto (AI)** - pozwala na automatyczne sterowanie mechanizmem za pomocą wbudowanych modeli sztucznej inteligencji (AI)

source: **Area** - allows you to limit the working modes for AI by setting the allowed area on the screen
pl: **Obszar / Area** - pozwala na ograniczenie trybów pracy dla AI za pomocą wyznaczenia dozwolonego obszaru na ekranie

source: **Filters** - allows you to filter object types, e.g. specifying classes for detected objects or their minimum scoring
pl: **Filtry / Filters** - pozwala na filtrowanie typów obiektów, np. określenie klas dla wykrywanych obiektów, czy ich minimalnego scoringu

source: **Video** - allows you to control the video image
pl: **Video** - pozwala na sterowanie obrazem video

source: **Options** – allows live configuration of the basic parameters of the tracking mode and servo operation (these and all other parameters are configurable in the **config.ini** file)
pl: **Opcje** – pozwala na konfigurację na żywo podstawowych parametrów trybu śledzenia i pracy serwa (te i wszystkie pozostałe parametry są konfigurowalne w pliku **config.ini**)

source: Manual mode
pl: Tryb ręczny (manualny)

source: In this mode, you can control the entire mechanism manually.
pl: W trybie tym można sterować całym mechanizmem manualnie.

source: Using the mouse (with the left button pressed - LMB), you can move the mechanism by moving the mouse around the area with the image from the camera. You can also use the **UP, DOWN, CENTER, LEFT, RIGHT** buttons on the left side to control. Use the **Speed** slider to change the speed of the mechanism in manual mode. With the **Zoom** slider you can zoom in or out the image from the camera (digital zoom).
pl: Przy pomocy myszki (z wciśniętym lewym przyciskiem - LPM) można przesuwać mechanizmem poruszając myszką po obszarze z obrazem z kamery. Do sterowania można także użyć przycisków **G, D, L, P, C**, dostępnych po lewej stronie, gdzie **G = ruch do góry**, **D = ruch do dołu**, **L = ruch w lewo**, **P = ruch w prawo**, **C = wyśrodkowanie**. Do zmiany szybkości przesuwania się mechanizmu w trybie manualnym służy suwak **Szybkość**. Suwakiem **Zoom** można przybliżać, lub oddalać obraz z kamery (cyfrowy zoom).

source: On the sides of the control buttons there are buttons with **actions** ( **A1**, **A2**, **A3**, **B4**, **B5**, **B6**).
pl: Po bokach od przycisków sterowania znajdują się przyciski z **akcjami** (**A1**, **A2**, **A3**, **B4**, **B5**, **B6**).

source: Actions (manual and automatic)
pl: Akcje (manualny i automatyczny)

source: The system allows you to remotely trigger predefined actions (remote control of additional behaviors on a connected device). There are **6** different slots for **6** different actions: **A1-A3** and **B4-B6.** These slots allow you to remotely activate a given action, where, for example, action **A1** can be responsible for giving **+5V (HIGH state)** on a defined pin on Arduino or Raspberry, and action **B4** for giving **+5V** on yet another pin. The code for Arduino available in the **Client / Arduino** directory defines the default pins for individual actions and the code that activates them - on the Arduino side, all you need to do is connect the appropriate devices to the appropriate pins:
pl: System pozwala na zdalne wyzwalanie uprzednio zdefiniowanych akcji (zdalne sterowanie dodatkowymi zachowaniami na podłączonym urządzeniu). Do dyspozycji jest **6** różnych slotów dla **6** różnych akcji: **A1-A3** oraz **B4-B6.** Sloty te pozwalają na zdalne załączenie danej akcji, gdzie np. akcja **A1** może być odpowiedzialna za podanie **+5V (stan HIGH)** na zdefiniowanym pin-ie na Arduino lub na Raspberry, a akcja **B4** za podanie **+5V** na jeszcze innym pin-ie. W kodzie dla Arduino dostępnym w katalogu **Client / Arduino** zdefiniowane są domyślne pin-y dla poszczególnych akcji oraz kod je aktywujący - po stronie Arduino wystarczy jedynie podłączyć odpowiednie urządzenia pod odpowiednie pin-y:

source: With the above code uploaded to the Arduino, activating the **A1** action will set pin **2** in **HIGH** state, and disabling the **A1** action will set the pin to **LOW** state. Similarly, it happens for other actions and other pins defined for them. **The configuration of the GPIO pins for Raspberry is in the **config.ini** file located in the directory with the client application: **Client / PC, Raspberry**.
pl: Posiadając wgrany powyższy kod na Arduino, uruchomienie akcji **A1** spowoduje na nim wprowadzenie pin-u **2** w **stan HIGH**, a wyłączenie akcji **A1** spowoduje powrót pin-u do **stanu LOW**. Analogicznie dzieje się to dla pozostałych akcji i pozostałych zdefiniowanych dla nich pin-ów. **Konfiguracja pinów GPIO dla Raspberry znajduje się w pliku config.ini w katalogu z aplikacją kliencką: Client / PC, Raspberry.**.

source: **Action working modes:**
pl: **Tryby pracy akcji:**

source: Each action can be activated in one of several operating modes:
pl: Każda z akcji może zostać załączona w jednym z kilku trybów pracy:

source: **LOCKED** - blocked execution of actions (actions disabled)
pl: **BLOKADA / OFF**- zablokowane wykonywanie akcji (akcje wyłączone)

source: **SINGLE** - causes one-time execution of the action (e.g. one-time activation of the **+5V/HIGH** state on the pin)
pl: **POJEDYŃCZY / SINGLE** - powoduje jednorazowe wykonanie akcji (np. jednorazowe załączenie na chwilę stanu **+5V/HIGH** na pin-ie)

source: **SERIES** - performs actions in series (time intervals), the length of the intervals can be defined in the tab used for automatic control
pl: **SERIA / SERIES** - powoduje wykonywanie akcji w seriach (odstępach czasowych), długość odstępów można zdefiniować w zakładce służacej do sterowania automatycznego

source: **CONTINUOUS** - activates the action in continuous mode, where by holding the LMB on the button with the action, we keep it in the active mode all the time, until the button is released
pl: **CIĄGŁY / CONTINUOUS** - powoduje załączenie akcji w trybie ciągłym, gdzie przytrzymując LPM na przycisku z akcją utrzymujemy ją cały czas w trybie włączonym, aż do zwolnienia przycisku

source: **TOGGLE** - works similarly to the **ON/OFF switch/trigger**, which can be used to enable or disable a given action, i.e. the first click on the action will turn it on and keep it in continuous mode from now on, and the next click will turn it off
pl: **PRZEŁĄCZ / TOGGLE** - działa podobnie jak przełącznik (trigger) **ON/OFF**, którym daną akcję można włączyć lub wyłączyć, tzn. pierwsze kliknięcie na akcję spowoduje jej włączenie i utrzymywanie jej od tej pory w trybie ciągłym, a kolejne kliknięcie spowoduje jej wyłączenie

source: Actions can also be activated using the keyboard, using **the numeric keys 1-6**, corresponding to the sequential numbers of the actions. **In the "LOCKED" mode, the buttons that trigger actions are inactive.**
pl: Akcje można również załączać za pomocą klawiatury, używając **klawiszy numerycznych 1-6**, odpowiadających kolejnym numerom akcji. **W trybie „Blokada” przyciski wyzwalające akcje są nieaktywne.**

source: Auto Mode (Artificial Intelligence - AI)
pl: Tryb auto (sztuczna inteligencja - AI)

source: The mode allows for automatic control using the selected **artificial intelligence (AI)** model.
pl: Tryb pozwala na sterowanie automatyczne za pomocą wybranego modelu **sztucznej inteligencji (AI)**.

source: The design of the application allows you to implement any AI model, in the current version the following neural network models are available:
pl: Konstrukcja aplikacji pozwala na zaimplementowanie dowolnego modelu AI, w obecnej wersji dostępne są następujące modele sieci neuronowych:

source: **Movenet** - a model for detecting human movement
pl: **Movenet** - model służący do detekcji ruchu człowieka

source: **Mobilenet SSD** - a model for detecting and classifying objects (e.g. person, car, tank, cat, dog, etc.)
pl: **Mobilenet SSD** - model służący do wykrywania i klasyfikacji obiektów (np. człowiek, samochód, czołg, kot, pies, etc.)

source: **OpenCV** - motion detection is done using the OpenCV library
pl: **OpenCV** - wykrywanie ruchu odbywa się za pomocą biblioteki OpenCV

source: **Movenet** model is available in 3 versions:
pl: Model **Movenet** dostępny jest w 3 wersjach:

source: **SINGLE POSE / ONE (lightning version)** - allows you to track only one person at a time
pl: **SINGLE POSE / JEDEN (wersja lightning)** - pozwala na śledzenie tylko jednego człowieka naraz

source: **SINGLE POSE / ONE (thunder version)** - as above, but works with greater accuracy at the expense of more computing power required
pl: **SINGLE POSE / JEDEN (wersja thunder)** - j/w, ale działa z większą dokładnością kosztem wymaganej większej mocy obliczeniowej

source: **MULTI POSE / MANY (lightning version)** - allows you to track many people at once
pl: **MULTI POSE / WIELE (wersja lightning)** - pozwala na śledzenie wielu ludzi naraz

source: The appropriate AI model can be selected from the **Model (AI)** menu.
pl: Odpowiedni model AI można wybrać z menu **Model (AI)**.

source: **Note:** for the automatic mode to be active, it is required to select a model from the list.
pl: **Uwaga:** aby tryb automatyczny był aktywny wymagane jest wybranie któregoś modelu z listy.

source: **Auto mode tab view:**
pl: **Widok zakładki trybu Auto:**

source: **Auto modes (tracking)**
pl: **Tryby pracy auto (Tracking)**

source: **OFF** - automatic control off
pl: **WYŁ. / OFF** - wyłączone sterowanie automatycznie

source: **IDLE** - tracking on the screen is enabled, however, no actions such as servo movement are performed
pl: **PAUZA / IDLE** - włączone śledzenie na ekranie, jednakże nie są wykonywane żadne akcje typu ruch serwomechanizmów

source: **FOLLOW** - enables tracking of the object, and the mechanism starts to follow the object and commands are sent to the servos
pl: **PODĄŻAJ / FOLLOW**- włącza śledzenie obiektu, a mechanizm zaczyna podążać za obiektem i wysyłane są komendy do serwomechanizmów

source: **PATROL** - patrol mode, when an object is detected, it works as the "FOLLOW" - while in the absence of a target, the mechanism automatically switches to patrol mode, in which the servo moves from one direction to another in the full range of movement of the mechanism in the X axis, in to find an object within the full field of view
pl: **PATROL** - tryb patrolowy, w przypadku wykrycia obiektu działa jak tryb **PODĄŻAJ/FOLLOW**, natomiast w przypadku braku celu mechanizm przełącza się automatycznie w tryb patrolowy, w którym ruch serwa wykonuje się od jednego kierunku do drugiego w pełnym zakresie ruchu mechanizmu w osi X, w celu odnalezienia obiektu znajdującego się w pełnym polu widzenia

source: **Tracking modes**
pl: **Tryby śledzenia/trackingu**

source: **LOCK** - causes automatic locking of the system on the detected object
pl: **ZALOKUJ** **/ LOCK**- powoduje automatyczne "zalokowanie się" systemu na wykrytym obiekcie

source: **SINGLE** - to be used with **LOCK** option, after turning on the system tries to keep attention only on one object and not automatically switch to other objects, e.g. after performing an action
pl: **JEDEN CEL / SINGLE** - do użycia z opcją **ZALOKUJ** , po włączeniu system stara się utrzymać uwagę tylko na jednym obiekcie oraz nie przełączać się automatycznie na inne obiekty np. po wykonaniu akcji

source: **Switching the object to lock (arrows at the bottom)**
pl: **Wybór obiektu do zalokowania (strzałki na dole)**

source: **«** - locates the system on the previous object in the X axis (if the selected AI model allows you to track many objects at once)
pl: **«** - lokuje system na poprzednim obiekcie w osi X (jeśli wybrany model AI pozwala na śledzenie wielu obiektów naraz)

source: **»** - locates the system on the next object in the X axis (if the selected AI model allows you to track many objects at once)
pl: **»** - lokuje system na następnym obiekcie w osi X (jeśli wybrany model AI pozwala na śledzenie wielu obiektów naraz)

source: **Action modes**
pl: **Tryby akcji**

source: Similarly to the manual mode, you can select the mode of activation of the action (**SINGLE**, **CONTINUOUS,** etc.), with the difference that in the **AUTO** mode, the activation of a given action takes place automatically after the system locks itself on the object.
pl: Analogicznie jak w trybie manualnym, można wybrać tryb załączenia się akcji (**POJEDYŃCZY**, **CIĄGŁY,** itd.), z tą różnicą, iż w trybie **AUTO** załączenie danej akcji dokonuje się automatycznie po zalokowaniu się systemu na obiekcie.

source: **"Action duration" slider** - allows you to decrease or increase the duration for continuous actions, zero value **(0)** causes no disablement.
pl: **Suwak "czas trwania akcji"** - pozwala na zmniejszenie lub zwiększenie czasu trwania dla akcji typu ciągłego, wartość zerowa **(0)** powoduje brak wyłączenia.

source: **Slider "time to switch to the next object"** - allows you to decrease or increase the time between switching to the next object.
pl: **Suwak "czas do przełączenia na kolejny obiekt"** - pozwala na zmniejszenie lub zwiększenie czasu pomiędzy przełączaniem się na następny obiekt.

source: **AUTO ON/OFF action** - enables automatic switching on of the action selected from the list.
pl: **Akcja AUTO ON/OFF** - włącza automatyczne załączanie się wybranej z listy akcji.

source: If the **AUTO ON/OFF** action switch is turned on, the action selected from the list is automatically activated after the system locks onto the object. After the time has elapsed (if **SINGLE** mode is not enabled, the system tries to switch to the next detected object and the procedure is repeated. The times between switching between objects and the duration of the action can be modified using the sliders.
pl: Jeśli przełącznik **Akcja AUTO ON/OFF** jest włączony to po zalokowaniu się systemu na obiekcie załączana jest automatycznie wybrana z listy akcja. Po upłynięciu czasu (jeśli nie jest włączony tryb **JEDEN CEL / SINGLE**) system próbuje przełączyć się na kolejny wykryty obiekt i procedura się powtarza. Czasy pomiędzy przełączeniami miedzy obiektami oraz czas trwania akcji można modyfikować za pomocą suwaków.

source: **Target**
pl: **Tryby celowania**

source: This option applies only to "person" objects and the **Movenet** model.
pl: Opcja ta dotyczy jedynie obiektów typu "człowiek" i modelu **Movenet**.

source: **AUTO** - causes the system to be located at the most optimal point on the person's body
pl: **AUTO** - powoduje lokowanie się systemu na najbardziej optymalnym punkcie na ciele człowieka

source: **HEAD** - causes the system to be placed on the head
pl: **GŁOWA / HEAD** - powoduje lokowanie się systemu na głowie

source: **NECK** - causes the system to be placed on the neck
pl: **SZYJA / NECK** - powoduje lokowanie się systemu na karku

source: **BOD** - causes the system to be located on the body / center of gravity
pl: **CIAŁO / BODY**- powoduje lokowanie się systemu na korpusie / środku ciężkości

source: **LEGS** - causes the system to locate itself on the legs if they are available in the field of view
pl: **NOGI** **/ LEGS** - powoduje lokowanie się systemu na nogach jeśli są dostępne w polu widzenia

source: Remote Status
pl: Zdalny status

source: The software allows for communication from the client to the server - this allows you to read the status from a remote device and transfer it to the server (on an ongoing basis or at intervals), thus informing, for example, about the status of the device after performing a given action on it. This status appears on the screen in **the lower left corner of the screen** with the image from the camera and **on the list of clients** in the case of a remote connection. You can specify what status data are to be sent back to the server - more about this in the chapter on preparing your own device status. Status polling can be enabled or disabled in the client application with the ``--status`` argument:
pl: Oprogramowanie pozwala na komunikację w stronę od klienta do serwera - pozwala to na odczyt statusu ze zdalnego urządzenia i przekazanie go do serwera (na bieżąco lub w odstępach czasowych), informując w ten sposób np. o stanie urządzenia po wykonaniu się na nim danej akcji. Status taki pojawia się na ekranie w **lewym dolnym rogu ekranu** z obrazem z kamery oraz **na liście klientów** w przypadku połączenia zdalnego. Można określić jakie dane statusowe mają być przysyłane zwrotnie do serwera – więcej o tym w rozdziale dotyczącym przygotowywania własnego statusu urządzenia. Odpytywanie o status może zostać włączone lub wyłączone w aplikacji klienckiej za pomocą argumentu ``--status``:

source: Restriction Areas
pl: Obszary ograniczające

source: With this tool, you can limit the areas for action for:
pl: Za pomocą tego narzędzia można ograniczyć obszary dla działania dla:

source: **Tracking** - object detection
pl: **Tracking** - wykrywania obiektów

source: **Patrol** - patrol mode
pl: **Patrol** - dla trybu patrolu

source: **Action** - automatic action triggering
pl: **Akcja / Action** - dla automatycznego wyzwalania akcji

source: After defining (drawing with the mouse) a boundary area on the video image, the specified operation will be limited to this area only.
pl: Po zdefiniowaniu (narysowaniu za pomocą myszki) na obrazie video obszaru ograniczającego, określone działanie będzie ograniczone tylko do tego obszaru.

source: The following options are available in the tool:
pl: W narzędziu dostępne są opcje:

source: **ON/OFF** - enables or disables the use of a given area
pl: **ON/OFF** - włącza lub wyłącza używanie danego obszaru

source: **Select** – enables drawing a new area with the mouse
pl: **Wybierz / Select** – kliknięcie włącza rysowanie nowego obszaru za pomocą myszki

source: **Clear** - removes the current active area
pl: **Usuń / Clear** - usuwa obecny aktywny obszar

source: **World** - enables or disables the mapping of the area to the real world (if enabled, the area will be assigned to coordinates in real space, not to the screen, i.e. the area will "virtually" follow the movement of the mechanism by sticking to a point in real space)
pl: **Real** - włącza lub wyłącza mapowanie obszaru do realnego świata (jeśli jest włączone to obszar będzie przypisany do koordynat w prawdziwej przestrzeni, a nie do ekranu, tj. obszar będzie „wirtualnie” podążać za ruchem mechanizmu trzymając się punktu w rzeczywistej przestrzeni)

source: You can also enter coordinates manually using the fields at the bottom.
pl: Kordynaty można również wpisać ręcznie za pomocą pól na dole.
